# Comparing `tmp/stepcounter-1.0.5-cp312-cp312-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip` & `tmp/stepcounter-1.0.6-cp312-cp312-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,91 +1,102 @@
-Zip file size: 91124 bytes, number of entries: 89
-drwxr-xr-x  2.0 unx        0 b- stor 24-Apr-30 13:55 stepcounter-1.0.5.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 24-Apr-30 13:55 stepcounter.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 24-Apr-30 13:55 example/
-drwxr-xr-x  2.0 unx        0 b- stor 24-Apr-30 13:55 src/
--rw-r--r--  2.0 unx      225 b- defN 24-Apr-30 13:55 stepcounter-1.0.5.dist-info/WHEEL
--rw-rw-r--  2.0 unx       12 b- defN 24-Apr-30 13:55 stepcounter-1.0.5.dist-info/top_level.txt
--rw-rw-r--  2.0 unx    10979 b- defN 24-Apr-30 13:55 stepcounter-1.0.5.dist-info/LICENSE
--rw-r--r--  2.0 unx      547 b- defN 24-Apr-30 13:55 stepcounter-1.0.5.dist-info/METADATA
--rw-rw-r--  2.0 unx       54 b- defN 24-Apr-30 13:55 stepcounter-1.0.5.dist-info/entry_points.txt
--rw-rw-r--  2.0 unx     7696 b- defN 24-Apr-30 13:55 stepcounter-1.0.5.dist-info/RECORD
--rw-r--r--  2.0 unx      259 b- defN 24-Apr-30 13:55 example/gcd.py
--rw-r--r--  2.0 unx     1248 b- defN 24-Apr-30 13:55 example/example.py
--rw-r--r--  2.0 unx        0 b- defN 24-Apr-30 13:55 example/__init__.py
-drwxr-xr-x  2.0 unx        0 b- stor 24-Apr-30 13:55 src/profiler/

     <7a>   DW_AT_decl_column : (data1) 27
     <7b>   DW_AT_type        : (ref4) <0x6a>, long int
  <1><7f>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <80>   DW_AT_byte_size   : (data1) 8
     <81>   DW_AT_type        : (ref4) <0x85>, char
  <1><85>: Abbrev Number: 3 (DW_TAG_base_type)
     <86>   DW_AT_byte_size   : (data1) 1
     <87>   DW_AT_encoding    : (data1) 6	(signed char)
-    <88>   DW_AT_name        : (strp) (offset: 0x996): char
+    <88>   DW_AT_name        : (strp) (offset: 0xa00): char
  <1><8c>: Abbrev Number: 7 (DW_TAG_const_type)
     <8d>   DW_AT_type        : (ref4) <0x85>, char
  <1><91>: Abbrev Number: 3 (DW_TAG_base_type)
     <92>   DW_AT_byte_size   : (data1) 8
     <93>   DW_AT_encoding    : (data1) 5	(signed)
-    <94>   DW_AT_name        : (strp) (offset: 0x53b): long long int
+    <94>   DW_AT_name        : (strp) (offset: 0x585): long long int
  <1><98>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <99>   DW_AT_byte_size   : (data1) 8
     <9a>   DW_AT_type        : (ref4) <0x8c>, char
  <1><9e>: Abbrev Number: 2 (DW_TAG_typedef)
-    <9f>   DW_AT_name        : (strp) (offset: 0x8cc): ssize_t
+    <9f>   DW_AT_name        : (strp) (offset: 0x92c): ssize_t
     <a3>   DW_AT_decl_file   : (data1) 5
     <a4>   DW_AT_decl_line   : (data1) 109
     <a5>   DW_AT_decl_column : (data1) 19
     <a6>   DW_AT_type        : (ref4) <0x73>, __ssize_t, long int
- <1><aa>: Abbrev Number: 3 (DW_TAG_base_type)
-    <ab>   DW_AT_byte_size   : (data1) 8
-    <ac>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <ad>   DW_AT_name        : (strp) (offset: 0x2f7): long long unsigned int
- <1><b1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <b2>   DW_AT_name        : (strp) (offset: 0x271): uint32_t
-    <b6>   DW_AT_decl_file   : (data1) 6
-    <b7>   DW_AT_decl_line   : (data1) 51
-    <b8>   DW_AT_decl_column : (data1) 23
-    <b9>   DW_AT_type        : (ref4) <0x55>, unsigned int
+ <1><aa>: Abbrev Number: 2 (DW_TAG_typedef)
+    <ab>   DW_AT_name        : (strp) (offset: 0x285): int32_t
+    <af>   DW_AT_decl_file   : (data1) 5
+    <b0>   DW_AT_decl_line   : (data1) 196
+    <b1>   DW_AT_decl_column : (data1) 1
+    <b2>   DW_AT_type        : (ref4) <0x40>, int
+ <1><b6>: Abbrev Number: 3 (DW_TAG_base_type)
+    <b7>   DW_AT_byte_size   : (data1) 8
+    <b8>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <b9>   DW_AT_name        : (strp) (offset: 0x31d): long long unsigned int
  <1><bd>: Abbrev Number: 2 (DW_TAG_typedef)
-    <be>   DW_AT_name        : (strp) (offset: 0x917): uintptr_t
+    <be>   DW_AT_name        : (strp) (offset: 0x284): uint32_t
     <c2>   DW_AT_decl_file   : (data1) 6
-    <c3>   DW_AT_decl_line   : (data1) 122
-    <c4>   DW_AT_decl_column : (data1) 27
-    <c5>   DW_AT_type        : (ref4) <0x39>, long unsigned int
+    <c3>   DW_AT_decl_line   : (data1) 51
+    <c4>   DW_AT_decl_column : (data1) 23
+    <c5>   DW_AT_type        : (ref4) <0x55>, unsigned int
  <1><c9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <ca>   DW_AT_name        : (strp) (offset: 0x471): Py_ssize_t
-    <ce>   DW_AT_decl_file   : (data1) 7
-    <cf>   DW_AT_decl_line   : (data1) 131
-    <d0>   DW_AT_decl_column : (data1) 25
-    <d1>   DW_AT_type        : (ref4) <0x9e>, ssize_t, __ssize_t, long int
+    <ca>   DW_AT_name        : (strp) (offset: 0x977): uintptr_t
+    <ce>   DW_AT_decl_file   : (data1) 6
+    <cf>   DW_AT_decl_line   : (data1) 122
+    <d0>   DW_AT_decl_column : (data1) 27
+    <d1>   DW_AT_type        : (ref4) <0x39>, long unsigned int
  <1><d5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <d6>   DW_AT_name        : (strp) (offset: 0x6c): Py_hash_t
+    <d6>   DW_AT_name        : (strp) (offset: 0x4a3): Py_ssize_t
     <da>   DW_AT_decl_file   : (data1) 7
-    <db>   DW_AT_decl_line   : (data1) 145
-    <dc>   DW_AT_decl_column : (data1) 20
-    <dd>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><e1>: Abbrev Number: 3 (DW_TAG_base_type)
-    <e2>   DW_AT_byte_size   : (data1) 4
-    <e3>   DW_AT_encoding    : (data1) 4	(float)
-    <e4>   DW_AT_name        : (strp) (offset: 0x911): float
- <1><e8>: Abbrev Number: 3 (DW_TAG_base_type)
-    <e9>   DW_AT_byte_size   : (data1) 8
-    <ea>   DW_AT_encoding    : (data1) 4	(float)
-    <eb>   DW_AT_name        : (strp) (offset: 0xb5a): double
- <1><ef>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <f0>   DW_AT_name        : (strp) (offset: 0x962): timezone
-    <f4>   DW_AT_byte_size   : (data1) 8
-    <f5>   DW_AT_decl_file   : (data1) 8
-    <f6>   DW_AT_decl_line   : (data1) 56
-    <f7>   DW_AT_decl_column : (data1) 8
-    <f8>   DW_AT_sibling     : (ref4) <0x117>
- <2><fc>: Abbrev Number: 9 (DW_TAG_member)
-    <fd>   DW_AT_name        : (strp) (offset: 0x175): tz_minuteswest
+    <db>   DW_AT_decl_line   : (data1) 131
+    <dc>   DW_AT_decl_column : (data1) 25
+    <dd>   DW_AT_type        : (ref4) <0x9e>, ssize_t, __ssize_t, long int
+ <1><e1>: Abbrev Number: 2 (DW_TAG_typedef)
+    <e2>   DW_AT_name        : (strp) (offset: 0x6c): Py_hash_t
+    <e6>   DW_AT_decl_file   : (data1) 7
+    <e7>   DW_AT_decl_line   : (data1) 145
+    <e8>   DW_AT_decl_column : (data1) 20
+    <e9>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><ed>: Abbrev Number: 3 (DW_TAG_base_type)
+    <ee>   DW_AT_byte_size   : (data1) 4
+    <ef>   DW_AT_encoding    : (data1) 4	(float)
+    <f0>   DW_AT_name        : (strp) (offset: 0x971): float
+ <1><f4>: Abbrev Number: 3 (DW_TAG_base_type)
+    <f5>   DW_AT_byte_size   : (data1) 8
+    <f6>   DW_AT_encoding    : (data1) 4	(float)
+    <f7>   DW_AT_name        : (strp) (offset: 0xbd7): double
+ <1><fb>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <fc>   DW_AT_name        : (strp) (offset: 0x9c2): timezone
+    <100>   DW_AT_byte_size   : (data1) 8
     <101>   DW_AT_decl_file   : (data1) 8
-    <102>   DW_AT_decl_line   : (data1) 58
-    <103>   DW_AT_decl_column : (data1) 9
-    <104>   DW_AT_type        : (ref4) <0x40>, int
-    <108>   DW_AT_data_member_location: (data1) 0
- <2><109>: Abbrev Number: 9 (DW_TAG_member)
-    <10a>   DW_AT_name        : (strp) (offset: 0xf): tz_dsttime
-    <10e>   DW_AT_decl_file   : (data1) 8
-    <10f>   DW_AT_decl_line   : (data1) 59
-    <110>   DW_AT_decl_column : (data1) 9
-    <111>   DW_AT_type        : (ref4) <0x40>, int
-    <115>   DW_AT_data_member_location: (data1) 4
- <2><116>: Abbrev Number: 0
- <1><117>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <118>   DW_AT_byte_size   : (data1) 8
-    <119>   DW_AT_type        : (ref4) <0xef>, timezone
- <1><11d>: Abbrev Number: 10 (DW_TAG_restrict_type)
-    <11e>   DW_AT_type        : (ref4) <0x117>, timezone
- <1><122>: Abbrev Number: 2 (DW_TAG_typedef)
-    <123>   DW_AT_name        : (strp) (offset: 0xb61): PyModuleDef
-    <127>   DW_AT_decl_file   : (data1) 9
-    <128>   DW_AT_decl_line   : (data1) 12
-    <129>   DW_AT_decl_column : (data1) 28
-    <12a>   DW_AT_type        : (ref4) <0x12e>, PyModuleDef
- <1><12e>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <12f>   DW_AT_name        : (strp) (offset: 0xb61): PyModuleDef
-    <133>   DW_AT_byte_size   : (data1) 104
-    <134>   DW_AT_decl_file   : (data1) 10
-    <135>   DW_AT_decl_line   : (data1) 98
-    <136>   DW_AT_decl_column : (data1) 8
-    <137>   DW_AT_sibling     : (ref4) <0x1b1>
- <2><13b>: Abbrev Number: 9 (DW_TAG_member)
-    <13c>   DW_AT_name        : (strp) (offset: 0xb1): m_base
+    <102>   DW_AT_decl_line   : (data1) 56
+    <103>   DW_AT_decl_column : (data1) 8
+    <104>   DW_AT_sibling     : (ref4) <0x123>
+ <2><108>: Abbrev Number: 9 (DW_TAG_member)
+    <109>   DW_AT_name        : (strp) (offset: 0x17f): tz_minuteswest
+    <10d>   DW_AT_decl_file   : (data1) 8
+    <10e>   DW_AT_decl_line   : (data1) 58
+    <10f>   DW_AT_decl_column : (data1) 9
+    <110>   DW_AT_type        : (ref4) <0x40>, int
+    <114>   DW_AT_data_member_location: (data1) 0
+ <2><115>: Abbrev Number: 9 (DW_TAG_member)
+    <116>   DW_AT_name        : (strp) (offset: 0xf): tz_dsttime
+    <11a>   DW_AT_decl_file   : (data1) 8
+    <11b>   DW_AT_decl_line   : (data1) 59
+    <11c>   DW_AT_decl_column : (data1) 9
+    <11d>   DW_AT_type        : (ref4) <0x40>, int
+    <121>   DW_AT_data_member_location: (data1) 4
+ <2><122>: Abbrev Number: 0
+ <1><123>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <124>   DW_AT_byte_size   : (data1) 8
+    <125>   DW_AT_type        : (ref4) <0xfb>, timezone
+ <1><129>: Abbrev Number: 10 (DW_TAG_restrict_type)
+    <12a>   DW_AT_type        : (ref4) <0x123>, timezone
+ <1><12e>: Abbrev Number: 2 (DW_TAG_typedef)
+    <12f>   DW_AT_name        : (strp) (offset: 0xbde): PyModuleDef
+    <133>   DW_AT_decl_file   : (data1) 9
+    <134>   DW_AT_decl_line   : (data1) 12
+    <135>   DW_AT_decl_column : (data1) 28
+    <136>   DW_AT_type        : (ref4) <0x13a>, PyModuleDef
+ <1><13a>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <13b>   DW_AT_name        : (strp) (offset: 0xbde): PyModuleDef
+    <13f>   DW_AT_byte_size   : (data1) 104
     <140>   DW_AT_decl_file   : (data1) 10
-    <141>   DW_AT_decl_line   : (data1) 99
-    <142>   DW_AT_decl_column : (data1) 20
-    <143>   DW_AT_type        : (ref4) <0xf9d>, PyModuleDef_Base, PyModuleDef_Base
-    <147>   DW_AT_data_member_location: (data1) 0
- <2><148>: Abbrev Number: 9 (DW_TAG_member)
-    <149>   DW_AT_name        : (strp) (offset: 0x60b): m_name
-    <14d>   DW_AT_decl_file   : (data1) 10
-    <14e>   DW_AT_decl_line   : (data1) 100
-    <14f>   DW_AT_decl_column : (data1) 15
-    <150>   DW_AT_type        : (ref4) <0x98>, char
-    <154>   DW_AT_data_member_location: (data1) 40
- <2><155>: Abbrev Number: 9 (DW_TAG_member)
-    <156>   DW_AT_name        : (strp) (offset: 0x96b): m_doc
-    <15a>   DW_AT_decl_file   : (data1) 10
-    <15b>   DW_AT_decl_line   : (data1) 101
-    <15c>   DW_AT_decl_column : (data1) 15
-    <15d>   DW_AT_type        : (ref4) <0x98>, char
-    <161>   DW_AT_data_member_location: (data1) 48
- <2><162>: Abbrev Number: 9 (DW_TAG_member)
-    <163>   DW_AT_name        : (strp) (offset: 0x534): m_size
-    <167>   DW_AT_decl_file   : (data1) 10
-    <168>   DW_AT_decl_line   : (data1) 102
-    <169>   DW_AT_decl_column : (data1) 14
-    <16a>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <16e>   DW_AT_data_member_location: (data1) 56
- <2><16f>: Abbrev Number: 9 (DW_TAG_member)
-    <170>   DW_AT_name        : (strp) (offset: 0x76): m_methods
-    <174>   DW_AT_decl_file   : (data1) 10
-    <175>   DW_AT_decl_line   : (data1) 103
-    <176>   DW_AT_decl_column : (data1) 16
-    <177>   DW_AT_type        : (ref4) <0xebe>, PyMethodDef, PyMethodDef
-    <17b>   DW_AT_data_member_location: (data1) 64
- <2><17c>: Abbrev Number: 9 (DW_TAG_member)
-    <17d>   DW_AT_name        : (strp) (offset: 0x809): m_slots
-    <181>   DW_AT_decl_file   : (data1) 10
-    <182>   DW_AT_decl_line   : (data1) 104
-    <183>   DW_AT_decl_column : (data1) 21
-    <184>   DW_AT_type        : (ref4) <0xfa9>, PyModuleDef_Slot, PyModuleDef_Slot
-    <188>   DW_AT_data_member_location: (data1) 72
- <2><189>: Abbrev Number: 9 (DW_TAG_member)
-    <18a>   DW_AT_name        : (strp) (offset: 0x935): m_traverse
-    <18e>   DW_AT_decl_file   : (data1) 10
-    <18f>   DW_AT_decl_line   : (data1) 105
-    <190>   DW_AT_decl_column : (data1) 16
-    <191>   DW_AT_type        : (ref4) <0x8fa>, traverseproc, int
-    <195>   DW_AT_data_member_location: (data1) 80
- <2><196>: Abbrev Number: 9 (DW_TAG_member)
-    <197>   DW_AT_name        : (strp) (offset: 0x118): m_clear
-    <19b>   DW_AT_decl_file   : (data1) 10
-    <19c>   DW_AT_decl_line   : (data1) 106
-    <19d>   DW_AT_decl_column : (data1) 11
-    <19e>   DW_AT_type        : (ref4) <0x7e9>, inquiry, int
-    <1a2>   DW_AT_data_member_location: (data1) 88
- <2><1a3>: Abbrev Number: 9 (DW_TAG_member)
-    <1a4>   DW_AT_name        : (strp) (offset: 0x248): m_free
-    <1a8>   DW_AT_decl_file   : (data1) 10
-    <1a9>   DW_AT_decl_line   : (data1) 107
-    <1aa>   DW_AT_decl_column : (data1) 12
-    <1ab>   DW_AT_type        : (ref4) <0x926>, freefunc
-    <1af>   DW_AT_data_member_location: (data1) 96
- <2><1b0>: Abbrev Number: 0
- <1><1b1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <1b2>   DW_AT_name        : (strp) (offset: 0x549): PyModuleDef_Slot
-    <1b6>   DW_AT_decl_file   : (data1) 9
-    <1b7>   DW_AT_decl_line   : (data1) 13
-    <1b8>   DW_AT_decl_column : (data1) 33
-    <1b9>   DW_AT_type        : (ref4) <0x1bd>, PyModuleDef_Slot
- <1><1bd>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <1be>   DW_AT_name        : (strp) (offset: 0x549): PyModuleDef_Slot
-    <1c2>   DW_AT_byte_size   : (data1) 16
-    <1c3>   DW_AT_decl_file   : (data1) 10
-    <1c4>   DW_AT_decl_line   : (data1) 74
-    <1c5>   DW_AT_decl_column : (data1) 8
-    <1c6>   DW_AT_sibling     : (ref4) <0x1e5>
- <2><1ca>: Abbrev Number: 9 (DW_TAG_member)
-    <1cb>   DW_AT_name        : (strp) (offset: 0x93): slot
+    <141>   DW_AT_decl_line   : (data1) 98
+    <142>   DW_AT_decl_column : (data1) 8
+    <143>   DW_AT_sibling     : (ref4) <0x1bd>
+ <2><147>: Abbrev Number: 9 (DW_TAG_member)
+    <148>   DW_AT_name        : (strp) (offset: 0xbb): m_base
+    <14c>   DW_AT_decl_file   : (data1) 10
+    <14d>   DW_AT_decl_line   : (data1) 99
+    <14e>   DW_AT_decl_column : (data1) 20
+    <14f>   DW_AT_type        : (ref4) <0xfb5>, PyModuleDef_Base, PyModuleDef_Base
+    <153>   DW_AT_data_member_location: (data1) 0
+ <2><154>: Abbrev Number: 9 (DW_TAG_member)
+    <155>   DW_AT_name        : (strp) (offset: 0x655): m_name
+    <159>   DW_AT_decl_file   : (data1) 10
+    <15a>   DW_AT_decl_line   : (data1) 100
+    <15b>   DW_AT_decl_column : (data1) 15
+    <15c>   DW_AT_type        : (ref4) <0x98>, char
+    <160>   DW_AT_data_member_location: (data1) 40
+ <2><161>: Abbrev Number: 9 (DW_TAG_member)
+    <162>   DW_AT_name        : (strp) (offset: 0x9d5): m_doc
+    <166>   DW_AT_decl_file   : (data1) 10
+    <167>   DW_AT_decl_line   : (data1) 101
+    <168>   DW_AT_decl_column : (data1) 15
+    <169>   DW_AT_type        : (ref4) <0x98>, char
+    <16d>   DW_AT_data_member_location: (data1) 48
+ <2><16e>: Abbrev Number: 9 (DW_TAG_member)
+    <16f>   DW_AT_name        : (strp) (offset: 0x57e): m_size
+    <173>   DW_AT_decl_file   : (data1) 10
+    <174>   DW_AT_decl_line   : (data1) 102
+    <175>   DW_AT_decl_column : (data1) 14
+    <176>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <17a>   DW_AT_data_member_location: (data1) 56
+ <2><17b>: Abbrev Number: 9 (DW_TAG_member)
+    <17c>   DW_AT_name        : (strp) (offset: 0x80): m_methods
+    <180>   DW_AT_decl_file   : (data1) 10
+    <181>   DW_AT_decl_line   : (data1) 103
+    <182>   DW_AT_decl_column : (data1) 16
+    <183>   DW_AT_type        : (ref4) <0xeca>, PyMethodDef, PyMethodDef
+    <187>   DW_AT_data_member_location: (data1) 64
+ <2><188>: Abbrev Number: 9 (DW_TAG_member)
+    <189>   DW_AT_name        : (strp) (offset: 0x869): m_slots
+    <18d>   DW_AT_decl_file   : (data1) 10
+    <18e>   DW_AT_decl_line   : (data1) 104
+    <18f>   DW_AT_decl_column : (data1) 21
+    <190>   DW_AT_type        : (ref4) <0xfc1>, PyModuleDef_Slot, PyModuleDef_Slot
+    <194>   DW_AT_data_member_location: (data1) 72
+ <2><195>: Abbrev Number: 9 (DW_TAG_member)
+    <196>   DW_AT_name        : (strp) (offset: 0x995): m_traverse
+    <19a>   DW_AT_decl_file   : (data1) 10
+    <19b>   DW_AT_decl_line   : (data1) 105
+    <19c>   DW_AT_decl_column : (data1) 16
+    <19d>   DW_AT_type        : (ref4) <0x906>, traverseproc, int
+    <1a1>   DW_AT_data_member_location: (data1) 80
+ <2><1a2>: Abbrev Number: 9 (DW_TAG_member)
+    <1a3>   DW_AT_name        : (strp) (offset: 0x122): m_clear
+    <1a7>   DW_AT_decl_file   : (data1) 10
+    <1a8>   DW_AT_decl_line   : (data1) 106
+    <1a9>   DW_AT_decl_column : (data1) 11
+    <1aa>   DW_AT_type        : (ref4) <0x7f5>, inquiry, int
+    <1ae>   DW_AT_data_member_location: (data1) 88
+ <2><1af>: Abbrev Number: 9 (DW_TAG_member)
+    <1b0>   DW_AT_name        : (strp) (offset: 0x25b): m_free
+    <1b4>   DW_AT_decl_file   : (data1) 10
+    <1b5>   DW_AT_decl_line   : (data1) 107
+    <1b6>   DW_AT_decl_column : (data1) 12
+    <1b7>   DW_AT_type        : (ref4) <0x932>, freefunc
+    <1bb>   DW_AT_data_member_location: (data1) 96
+ <2><1bc>: Abbrev Number: 0
+ <1><1bd>: Abbrev Number: 2 (DW_TAG_typedef)
+    <1be>   DW_AT_name        : (strp) (offset: 0x593): PyModuleDef_Slot
+    <1c2>   DW_AT_decl_file   : (data1) 9
+    <1c3>   DW_AT_decl_line   : (data1) 13
+    <1c4>   DW_AT_decl_column : (data1) 33
+    <1c5>   DW_AT_type        : (ref4) <0x1c9>, PyModuleDef_Slot
+ <1><1c9>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <1ca>   DW_AT_name        : (strp) (offset: 0x593): PyModuleDef_Slot
+    <1ce>   DW_AT_byte_size   : (data1) 16
     <1cf>   DW_AT_decl_file   : (data1) 10
-    <1d0>   DW_AT_decl_line   : (data1) 75
-    <1d1>   DW_AT_decl_column : (data1) 9
-    <1d2>   DW_AT_type        : (ref4) <0x40>, int
-    <1d6>   DW_AT_data_member_location: (data1) 0
- <2><1d7>: Abbrev Number: 9 (DW_TAG_member)
-    <1d8>   DW_AT_name        : (strp) (offset: 0xee): value
-    <1dc>   DW_AT_decl_file   : (data1) 10
-    <1dd>   DW_AT_decl_line   : (data1) 76
-    <1de>   DW_AT_decl_column : (data1) 11
-    <1df>   DW_AT_type        : (ref4) <0x71>
-    <1e3>   DW_AT_data_member_location: (data1) 8
- <2><1e4>: Abbrev Number: 0
- <1><1e5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <1e6>   DW_AT_name        : (strp) (offset: 0x857): PyMethodDef
-    <1ea>   DW_AT_decl_file   : (data1) 9
-    <1eb>   DW_AT_decl_line   : (data1) 14
-    <1ec>   DW_AT_decl_column : (data1) 28
-    <1ed>   DW_AT_type        : (ref4) <0x1f1>, PyMethodDef
- <1><1f1>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <1f2>   DW_AT_name        : (strp) (offset: 0x857): PyMethodDef
-    <1f6>   DW_AT_byte_size   : (data1) 32
-    <1f7>   DW_AT_decl_file   : (data1) 11
-    <1f8>   DW_AT_decl_line   : (data1) 54
-    <1f9>   DW_AT_decl_column : (data1) 8
-    <1fa>   DW_AT_sibling     : (ref4) <0x233>
- <2><1fe>: Abbrev Number: 9 (DW_TAG_member)
-    <1ff>   DW_AT_name        : (strp) (offset: 0x761): ml_name
+    <1d0>   DW_AT_decl_line   : (data1) 74
+    <1d1>   DW_AT_decl_column : (data1) 8
+    <1d2>   DW_AT_sibling     : (ref4) <0x1f1>
+ <2><1d6>: Abbrev Number: 9 (DW_TAG_member)
+    <1d7>   DW_AT_name        : (strp) (offset: 0x9d): slot
+    <1db>   DW_AT_decl_file   : (data1) 10
+    <1dc>   DW_AT_decl_line   : (data1) 75
+    <1dd>   DW_AT_decl_column : (data1) 9
+    <1de>   DW_AT_type        : (ref4) <0x40>, int
+    <1e2>   DW_AT_data_member_location: (data1) 0
+ <2><1e3>: Abbrev Number: 9 (DW_TAG_member)
+    <1e4>   DW_AT_name        : (strp) (offset: 0xf8): value
+    <1e8>   DW_AT_decl_file   : (data1) 10
+    <1e9>   DW_AT_decl_line   : (data1) 76
+    <1ea>   DW_AT_decl_column : (data1) 11
+    <1eb>   DW_AT_type        : (ref4) <0x71>
+    <1ef>   DW_AT_data_member_location: (data1) 8
+ <2><1f0>: Abbrev Number: 0
+ <1><1f1>: Abbrev Number: 2 (DW_TAG_typedef)
+    <1f2>   DW_AT_name        : (strp) (offset: 0x8b7): PyMethodDef
+    <1f6>   DW_AT_decl_file   : (data1) 9
+    <1f7>   DW_AT_decl_line   : (data1) 14
+    <1f8>   DW_AT_decl_column : (data1) 28
+    <1f9>   DW_AT_type        : (ref4) <0x1fd>, PyMethodDef
+ <1><1fd>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <1fe>   DW_AT_name        : (strp) (offset: 0x8b7): PyMethodDef
+    <202>   DW_AT_byte_size   : (data1) 32
     <203>   DW_AT_decl_file   : (data1) 11
-    <204>   DW_AT_decl_line   : (data1) 55
-    <205>   DW_AT_decl_column : (data1) 18
-    <206>   DW_AT_type        : (ref4) <0x98>, char
-    <20a>   DW_AT_data_member_location: (data1) 0
- <2><20b>: Abbrev Number: 9 (DW_TAG_member)
-    <20c>   DW_AT_name        : (strp) (offset: 0x1fb): ml_meth
-    <210>   DW_AT_decl_file   : (data1) 11
-    <211>   DW_AT_decl_line   : (data1) 56
-    <212>   DW_AT_decl_column : (data1) 17
-    <213>   DW_AT_type        : (ref4) <0xf44>, PyCFunction, PyObject, _object
-    <217>   DW_AT_data_member_location: (data1) 8
- <2><218>: Abbrev Number: 9 (DW_TAG_member)
-    <219>   DW_AT_name        : (strp) (offset: 0xa1d): ml_flags
-    <21d>   DW_AT_decl_file   : (data1) 11
-    <21e>   DW_AT_decl_line   : (data1) 57
-    <21f>   DW_AT_decl_column : (data1) 17
-    <220>   DW_AT_type        : (ref4) <0x40>, int
-    <224>   DW_AT_data_member_location: (data1) 16
- <2><225>: Abbrev Number: 9 (DW_TAG_member)
-    <226>   DW_AT_name        : (strp) (offset: 0x82a): ml_doc
-    <22a>   DW_AT_decl_file   : (data1) 11
-    <22b>   DW_AT_decl_line   : (data1) 59
-    <22c>   DW_AT_decl_column : (data1) 18
-    <22d>   DW_AT_type        : (ref4) <0x98>, char
-    <231>   DW_AT_data_member_location: (data1) 24
- <2><232>: Abbrev Number: 0
- <1><233>: Abbrev Number: 2 (DW_TAG_typedef)
-    <234>   DW_AT_name        : (strp) (offset: 0x98): PyGetSetDef
-    <238>   DW_AT_decl_file   : (data1) 9
-    <239>   DW_AT_decl_line   : (data1) 15
-    <23a>   DW_AT_decl_column : (data1) 28
-    <23b>   DW_AT_type        : (ref4) <0x23f>, PyGetSetDef
- <1><23f>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <240>   DW_AT_name        : (strp) (offset: 0x98): PyGetSetDef
-    <244>   DW_AT_byte_size   : (data1) 40
-    <245>   DW_AT_decl_file   : (data1) 12
-    <246>   DW_AT_decl_line   : (data1) 11
-    <247>   DW_AT_decl_column : (data1) 8
-    <248>   DW_AT_sibling     : (ref4) <0x28e>
- <2><24c>: Abbrev Number: 9 (DW_TAG_member)
-    <24d>   DW_AT_name        : (strp) (offset: 0x764): name
+    <204>   DW_AT_decl_line   : (data1) 54
+    <205>   DW_AT_decl_column : (data1) 8
+    <206>   DW_AT_sibling     : (ref4) <0x23f>
+ <2><20a>: Abbrev Number: 9 (DW_TAG_member)
+    <20b>   DW_AT_name        : (strp) (offset: 0x7c1): ml_name
+    <20f>   DW_AT_decl_file   : (data1) 11
+    <210>   DW_AT_decl_line   : (data1) 55
+    <211>   DW_AT_decl_column : (data1) 18
+    <212>   DW_AT_type        : (ref4) <0x98>, char
+    <216>   DW_AT_data_member_location: (data1) 0
+ <2><217>: Abbrev Number: 9 (DW_TAG_member)
+    <218>   DW_AT_name        : (strp) (offset: 0x20e): ml_meth
+    <21c>   DW_AT_decl_file   : (data1) 11
+    <21d>   DW_AT_decl_line   : (data1) 56
+    <21e>   DW_AT_decl_column : (data1) 17
+    <21f>   DW_AT_type        : (ref4) <0xf5c>, PyCFunction, PyObject, _object
+    <223>   DW_AT_data_member_location: (data1) 8
+ <2><224>: Abbrev Number: 9 (DW_TAG_member)
+    <225>   DW_AT_name        : (strp) (offset: 0xa9a): ml_flags
+    <229>   DW_AT_decl_file   : (data1) 11
+    <22a>   DW_AT_decl_line   : (data1) 57
+    <22b>   DW_AT_decl_column : (data1) 17
+    <22c>   DW_AT_type        : (ref4) <0x40>, int
+    <230>   DW_AT_data_member_location: (data1) 16
+ <2><231>: Abbrev Number: 9 (DW_TAG_member)
+    <232>   DW_AT_name        : (strp) (offset: 0x88a): ml_doc
+    <236>   DW_AT_decl_file   : (data1) 11
+    <237>   DW_AT_decl_line   : (data1) 59
+    <238>   DW_AT_decl_column : (data1) 18
+    <239>   DW_AT_type        : (ref4) <0x98>, char
+    <23d>   DW_AT_data_member_location: (data1) 24
+ <2><23e>: Abbrev Number: 0
+ <1><23f>: Abbrev Number: 2 (DW_TAG_typedef)
+    <240>   DW_AT_name        : (strp) (offset: 0xa2): PyGetSetDef
+    <244>   DW_AT_decl_file   : (data1) 9
+    <245>   DW_AT_decl_line   : (data1) 15
+    <246>   DW_AT_decl_column : (data1) 28
+    <247>   DW_AT_type        : (ref4) <0x24b>, PyGetSetDef
+ <1><24b>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <24c>   DW_AT_name        : (strp) (offset: 0xa2): PyGetSetDef
+    <250>   DW_AT_byte_size   : (data1) 40
     <251>   DW_AT_decl_file   : (data1) 12
-    <252>   DW_AT_decl_line   : (data1) 12
-    <253>   DW_AT_decl_column : (data1) 17
-    <254>   DW_AT_type        : (ref4) <0x98>, char
-    <258>   DW_AT_data_member_location: (data1) 0
- <2><259>: Abbrev Number: 11 (DW_TAG_member)
-    <25a>   DW_AT_name        : (string) get
-    <25e>   DW_AT_decl_file   : (data1) 12
-    <25f>   DW_AT_decl_line   : (data1) 13
-    <260>   DW_AT_decl_column : (data1) 12
-    <261>   DW_AT_type        : (ref4) <0xfc9>, getter, PyObject, _object
-    <265>   DW_AT_data_member_location: (data1) 8
- <2><266>: Abbrev Number: 11 (DW_TAG_member)
-    <267>   DW_AT_name        : (string) set
-    <26b>   DW_AT_decl_file   : (data1) 12
-    <26c>   DW_AT_decl_line   : (data1) 14
-    <26d>   DW_AT_decl_column : (data1) 12
-    <26e>   DW_AT_type        : (ref4) <0xfd5>, setter, int
-    <272>   DW_AT_data_member_location: (data1) 16
- <2><273>: Abbrev Number: 11 (DW_TAG_member)
-    <274>   DW_AT_name        : (string) doc
-    <278>   DW_AT_decl_file   : (data1) 12
-    <279>   DW_AT_decl_line   : (data1) 15
-    <27a>   DW_AT_decl_column : (data1) 17
-    <27b>   DW_AT_type        : (ref4) <0x98>, char
-    <27f>   DW_AT_data_member_location: (data1) 24
- <2><280>: Abbrev Number: 9 (DW_TAG_member)
-    <281>   DW_AT_name        : (strp) (offset: 0x84f): closure
-    <285>   DW_AT_decl_file   : (data1) 12
-    <286>   DW_AT_decl_line   : (data1) 16
-    <287>   DW_AT_decl_column : (data1) 11
-    <288>   DW_AT_type        : (ref4) <0x71>
-    <28c>   DW_AT_data_member_location: (data1) 32
- <2><28d>: Abbrev Number: 0
- <1><28e>: Abbrev Number: 2 (DW_TAG_typedef)
-    <28f>   DW_AT_name        : (strp) (offset: 0x971): PyMemberDef
-    <293>   DW_AT_decl_file   : (data1) 9
-    <294>   DW_AT_decl_line   : (data1) 16
-    <295>   DW_AT_decl_column : (data1) 28
-    <296>   DW_AT_type        : (ref4) <0x29a>, PyMemberDef
- <1><29a>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <29b>   DW_AT_name        : (strp) (offset: 0x971): PyMemberDef
-    <29f>   DW_AT_byte_size   : (data1) 40
-    <2a0>   DW_AT_decl_file   : (data1) 12
-    <2a1>   DW_AT_decl_line   : (data1) 41
-    <2a2>   DW_AT_decl_column : (data1) 8
-    <2a3>   DW_AT_sibling     : (ref4) <0x2e9>
- <2><2a7>: Abbrev Number: 9 (DW_TAG_member)
-    <2a8>   DW_AT_name        : (strp) (offset: 0x764): name
+    <252>   DW_AT_decl_line   : (data1) 11
+    <253>   DW_AT_decl_column : (data1) 8
+    <254>   DW_AT_sibling     : (ref4) <0x29a>
+ <2><258>: Abbrev Number: 9 (DW_TAG_member)
+    <259>   DW_AT_name        : (strp) (offset: 0x7c4): name
+    <25d>   DW_AT_decl_file   : (data1) 12
+    <25e>   DW_AT_decl_line   : (data1) 12
+    <25f>   DW_AT_decl_column : (data1) 17
+    <260>   DW_AT_type        : (ref4) <0x98>, char
+    <264>   DW_AT_data_member_location: (data1) 0
+ <2><265>: Abbrev Number: 11 (DW_TAG_member)
+    <266>   DW_AT_name        : (string) get
+    <26a>   DW_AT_decl_file   : (data1) 12
+    <26b>   DW_AT_decl_line   : (data1) 13
+    <26c>   DW_AT_decl_column : (data1) 12
+    <26d>   DW_AT_type        : (ref4) <0xfe1>, getter, PyObject, _object
+    <271>   DW_AT_data_member_location: (data1) 8
+ <2><272>: Abbrev Number: 11 (DW_TAG_member)
+    <273>   DW_AT_name        : (string) set
+    <277>   DW_AT_decl_file   : (data1) 12
+    <278>   DW_AT_decl_line   : (data1) 14
+    <279>   DW_AT_decl_column : (data1) 12
+    <27a>   DW_AT_type        : (ref4) <0xfed>, setter, int
+    <27e>   DW_AT_data_member_location: (data1) 16
+ <2><27f>: Abbrev Number: 11 (DW_TAG_member)
+    <280>   DW_AT_name        : (string) doc
+    <284>   DW_AT_decl_file   : (data1) 12
+    <285>   DW_AT_decl_line   : (data1) 15
+    <286>   DW_AT_decl_column : (data1) 17
+    <287>   DW_AT_type        : (ref4) <0x98>, char
+    <28b>   DW_AT_data_member_location: (data1) 24
+ <2><28c>: Abbrev Number: 9 (DW_TAG_member)
+    <28d>   DW_AT_name        : (strp) (offset: 0x8af): closure
+    <291>   DW_AT_decl_file   : (data1) 12
+    <292>   DW_AT_decl_line   : (data1) 16
+    <293>   DW_AT_decl_column : (data1) 11
+    <294>   DW_AT_type        : (ref4) <0x71>
+    <298>   DW_AT_data_member_location: (data1) 32
+ <2><299>: Abbrev Number: 0
+ <1><29a>: Abbrev Number: 2 (DW_TAG_typedef)
+    <29b>   DW_AT_name        : (strp) (offset: 0x9db): PyMemberDef
+    <29f>   DW_AT_decl_file   : (data1) 9
+    <2a0>   DW_AT_decl_line   : (data1) 16
+    <2a1>   DW_AT_decl_column : (data1) 28
+    <2a2>   DW_AT_type        : (ref4) <0x2a6>, PyMemberDef
+ <1><2a6>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <2a7>   DW_AT_name        : (strp) (offset: 0x9db): PyMemberDef
+    <2ab>   DW_AT_byte_size   : (data1) 40
     <2ac>   DW_AT_decl_file   : (data1) 12
-    <2ad>   DW_AT_decl_line   : (data1) 42
-    <2ae>   DW_AT_decl_column : (data1) 17
-    <2af>   DW_AT_type        : (ref4) <0x98>, char
-    <2b3>   DW_AT_data_member_location: (data1) 0
- <2><2b4>: Abbrev Number: 9 (DW_TAG_member)
-    <2b5>   DW_AT_name        : (strp) (offset: 0xac9): type
-    <2b9>   DW_AT_decl_file   : (data1) 12
-    <2ba>   DW_AT_decl_line   : (data1) 43
-    <2bb>   DW_AT_decl_column : (data1) 9
-    <2bc>   DW_AT_type        : (ref4) <0x40>, int
-    <2c0>   DW_AT_data_member_location: (data1) 8
- <2><2c1>: Abbrev Number: 9 (DW_TAG_member)
-    <2c2>   DW_AT_name        : (strp) (offset: 0xb0d): offset
-    <2c6>   DW_AT_decl_file   : (data1) 12
-    <2c7>   DW_AT_decl_line   : (data1) 44
-    <2c8>   DW_AT_decl_column : (data1) 16
-    <2c9>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <2cd>   DW_AT_data_member_location: (data1) 16
- <2><2ce>: Abbrev Number: 9 (DW_TAG_member)
-    <2cf>   DW_AT_name        : (strp) (offset: 0xa20): flags
-    <2d3>   DW_AT_decl_file   : (data1) 12
-    <2d4>   DW_AT_decl_line   : (data1) 45
-    <2d5>   DW_AT_decl_column : (data1) 9
-    <2d6>   DW_AT_type        : (ref4) <0x40>, int
-    <2da>   DW_AT_data_member_location: (data1) 24
- <2><2db>: Abbrev Number: 11 (DW_TAG_member)
-    <2dc>   DW_AT_name        : (string) doc
-    <2e0>   DW_AT_decl_file   : (data1) 12
-    <2e1>   DW_AT_decl_line   : (data1) 46
-    <2e2>   DW_AT_decl_column : (data1) 17
-    <2e3>   DW_AT_type        : (ref4) <0x98>, char
-    <2e7>   DW_AT_data_member_location: (data1) 32
- <2><2e8>: Abbrev Number: 0
- <1><2e9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2ea>   DW_AT_name        : (strp) (offset: 0x57c): PyObject
-    <2ee>   DW_AT_decl_file   : (data1) 9
-    <2ef>   DW_AT_decl_line   : (data1) 18
-    <2f0>   DW_AT_decl_column : (data1) 24
-    <2f1>   DW_AT_type        : (ref4) <0x2f5>, _object
- <1><2f5>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <2f6>   DW_AT_name        : (strp) (offset: 0x3cf): _object
-    <2fa>   DW_AT_byte_size   : (data1) 16
-    <2fb>   DW_AT_decl_file   : (data1) 1
-    <2fc>   DW_AT_decl_line   : (data1) 166
-    <2fd>   DW_AT_decl_column : (data1) 8
-    <2fe>   DW_AT_sibling     : (ref4) <0x316>
- <2><302>: Abbrev Number: 12 (DW_TAG_member)
-    <303>   DW_AT_type        : (ref4) <0x70c>
-    <307>   DW_AT_data_member_location: (data1) 0
- <2><308>: Abbrev Number: 9 (DW_TAG_member)
-    <309>   DW_AT_name        : (strp) (offset: 0xac6): ob_type
-    <30d>   DW_AT_decl_file   : (data1) 1
-    <30e>   DW_AT_decl_line   : (data1) 190
-    <30f>   DW_AT_decl_column : (data1) 19
-    <310>   DW_AT_type        : (ref4) <0x73e>, PyTypeObject, _typeobject
-    <314>   DW_AT_data_member_location: (data1) 8
- <2><315>: Abbrev Number: 0
- <1><316>: Abbrev Number: 2 (DW_TAG_typedef)
-    <317>   DW_AT_name        : (strp) (offset: 0x10b): PyLongObject
-    <31b>   DW_AT_decl_file   : (data1) 9
-    <31c>   DW_AT_decl_line   : (data1) 19
-    <31d>   DW_AT_decl_column : (data1) 28
-    <31e>   DW_AT_type        : (ref4) <0x322>, _longobject
- <1><322>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <323>   DW_AT_name        : (strp) (offset: 0x87): _longobject
-    <327>   DW_AT_byte_size   : (data1) 32
-    <328>   DW_AT_decl_file   : (data1) 13
-    <329>   DW_AT_decl_line   : (data1) 87
-    <32a>   DW_AT_decl_column : (data1) 8
-    <32b>   DW_AT_sibling     : (ref4) <0x34a>
- <2><32f>: Abbrev Number: 9 (DW_TAG_member)
-    <330>   DW_AT_name        : (strp) (offset: 0x2bb): ob_base
+    <2ad>   DW_AT_decl_line   : (data1) 41
+    <2ae>   DW_AT_decl_column : (data1) 8
+    <2af>   DW_AT_sibling     : (ref4) <0x2f5>
+ <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
+    <2b4>   DW_AT_name        : (strp) (offset: 0x7c4): name
+    <2b8>   DW_AT_decl_file   : (data1) 12
+    <2b9>   DW_AT_decl_line   : (data1) 42
+    <2ba>   DW_AT_decl_column : (data1) 17
+    <2bb>   DW_AT_type        : (ref4) <0x98>, char
+    <2bf>   DW_AT_data_member_location: (data1) 0
+ <2><2c0>: Abbrev Number: 9 (DW_TAG_member)
+    <2c1>   DW_AT_name        : (strp) (offset: 0xb46): type
+    <2c5>   DW_AT_decl_file   : (data1) 12
+    <2c6>   DW_AT_decl_line   : (data1) 43
+    <2c7>   DW_AT_decl_column : (data1) 9
+    <2c8>   DW_AT_type        : (ref4) <0x40>, int
+    <2cc>   DW_AT_data_member_location: (data1) 8
+ <2><2cd>: Abbrev Number: 9 (DW_TAG_member)
+    <2ce>   DW_AT_name        : (strp) (offset: 0xb8a): offset
+    <2d2>   DW_AT_decl_file   : (data1) 12
+    <2d3>   DW_AT_decl_line   : (data1) 44
+    <2d4>   DW_AT_decl_column : (data1) 16
+    <2d5>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <2d9>   DW_AT_data_member_location: (data1) 16
+ <2><2da>: Abbrev Number: 9 (DW_TAG_member)
+    <2db>   DW_AT_name        : (strp) (offset: 0xa9d): flags
+    <2df>   DW_AT_decl_file   : (data1) 12
+    <2e0>   DW_AT_decl_line   : (data1) 45
+    <2e1>   DW_AT_decl_column : (data1) 9
+    <2e2>   DW_AT_type        : (ref4) <0x40>, int
+    <2e6>   DW_AT_data_member_location: (data1) 24
+ <2><2e7>: Abbrev Number: 11 (DW_TAG_member)
+    <2e8>   DW_AT_name        : (string) doc
+    <2ec>   DW_AT_decl_file   : (data1) 12
+    <2ed>   DW_AT_decl_line   : (data1) 46
+    <2ee>   DW_AT_decl_column : (data1) 17
+    <2ef>   DW_AT_type        : (ref4) <0x98>, char
+    <2f3>   DW_AT_data_member_location: (data1) 32
+ <2><2f4>: Abbrev Number: 0
+ <1><2f5>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2f6>   DW_AT_name        : (strp) (offset: 0x5c6): PyObject
+    <2fa>   DW_AT_decl_file   : (data1) 9
+    <2fb>   DW_AT_decl_line   : (data1) 18
+    <2fc>   DW_AT_decl_column : (data1) 24
+    <2fd>   DW_AT_type        : (ref4) <0x301>, _object
+ <1><301>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <302>   DW_AT_name        : (strp) (offset: 0x3f5): _object
+    <306>   DW_AT_byte_size   : (data1) 16
+    <307>   DW_AT_decl_file   : (data1) 1
+    <308>   DW_AT_decl_line   : (data1) 166
+    <309>   DW_AT_decl_column : (data1) 8
+    <30a>   DW_AT_sibling     : (ref4) <0x322>
+ <2><30e>: Abbrev Number: 12 (DW_TAG_member)
+    <30f>   DW_AT_type        : (ref4) <0x718>
+    <313>   DW_AT_data_member_location: (data1) 0
+ <2><314>: Abbrev Number: 9 (DW_TAG_member)
+    <315>   DW_AT_name        : (strp) (offset: 0xb43): ob_type
+    <319>   DW_AT_decl_file   : (data1) 1
+    <31a>   DW_AT_decl_line   : (data1) 190
+    <31b>   DW_AT_decl_column : (data1) 19
+    <31c>   DW_AT_type        : (ref4) <0x74a>, PyTypeObject, _typeobject
+    <320>   DW_AT_data_member_location: (data1) 8
+ <2><321>: Abbrev Number: 0
+ <1><322>: Abbrev Number: 2 (DW_TAG_typedef)
+    <323>   DW_AT_name        : (strp) (offset: 0x115): PyLongObject
+    <327>   DW_AT_decl_file   : (data1) 9
+    <328>   DW_AT_decl_line   : (data1) 19
+    <329>   DW_AT_decl_column : (data1) 28
+    <32a>   DW_AT_type        : (ref4) <0x32e>, _longobject
+ <1><32e>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <32f>   DW_AT_name        : (strp) (offset: 0x91): _longobject
+    <333>   DW_AT_byte_size   : (data1) 32
     <334>   DW_AT_decl_file   : (data1) 13
-    <335>   DW_AT_decl_line   : (data1) 88
-    <336>   DW_AT_decl_column : (data1) 5
-    <337>   DW_AT_type        : (ref4) <0x2e9>, PyObject, _object
-    <33b>   DW_AT_data_member_location: (data1) 0
- <2><33c>: Abbrev Number: 9 (DW_TAG_member)
-    <33d>   DW_AT_name        : (strp) (offset: 0xe9): long_value
-    <341>   DW_AT_decl_file   : (data1) 13
-    <342>   DW_AT_decl_line   : (data1) 89
-    <343>   DW_AT_decl_column : (data1) 18
-    <344>   DW_AT_type        : (ref4) <0xf20>, _PyLongValue, _PyLongValue
-    <348>   DW_AT_data_member_location: (data1) 16
- <2><349>: Abbrev Number: 0
- <1><34a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <34b>   DW_AT_name        : (strp) (offset: 0x464): PyTypeObject
-    <34f>   DW_AT_decl_file   : (data1) 9
-    <350>   DW_AT_decl_line   : (data1) 20
-    <351>   DW_AT_decl_column : (data1) 28
-    <352>   DW_AT_type        : (ref4) <0x356>, _typeobject
- <1><356>: Abbrev Number: 13 (DW_TAG_structure_type)
-    <357>   DW_AT_name        : (strp) (offset: 0x4de): _typeobject
-    <35b>   DW_AT_byte_size   : (data2) 416
-    <35d>   DW_AT_decl_file   : (data1) 14
-    <35e>   DW_AT_decl_line   : (data1) 146
-    <35f>   DW_AT_decl_column : (data1) 8
-    <360>   DW_AT_sibling     : (ref4) <0x603>
- <2><364>: Abbrev Number: 9 (DW_TAG_member)
-    <365>   DW_AT_name        : (strp) (offset: 0x2bb): ob_base
+    <335>   DW_AT_decl_line   : (data1) 87
+    <336>   DW_AT_decl_column : (data1) 8
+    <337>   DW_AT_sibling     : (ref4) <0x356>
+ <2><33b>: Abbrev Number: 9 (DW_TAG_member)
+    <33c>   DW_AT_name        : (strp) (offset: 0x2ce): ob_base
+    <340>   DW_AT_decl_file   : (data1) 13
+    <341>   DW_AT_decl_line   : (data1) 88
+    <342>   DW_AT_decl_column : (data1) 5
+    <343>   DW_AT_type        : (ref4) <0x2f5>, PyObject, _object
+    <347>   DW_AT_data_member_location: (data1) 0
+ <2><348>: Abbrev Number: 9 (DW_TAG_member)
+    <349>   DW_AT_name        : (strp) (offset: 0xf3): long_value
+    <34d>   DW_AT_decl_file   : (data1) 13
+    <34e>   DW_AT_decl_line   : (data1) 89
+    <34f>   DW_AT_decl_column : (data1) 18
+    <350>   DW_AT_type        : (ref4) <0xf38>, _PyLongValue, _PyLongValue
+    <354>   DW_AT_data_member_location: (data1) 16
+ <2><355>: Abbrev Number: 0
+ <1><356>: Abbrev Number: 2 (DW_TAG_typedef)
+    <357>   DW_AT_name        : (strp) (offset: 0x496): PyTypeObject
+    <35b>   DW_AT_decl_file   : (data1) 9
+    <35c>   DW_AT_decl_line   : (data1) 20
+    <35d>   DW_AT_decl_column : (data1) 28
+    <35e>   DW_AT_type        : (ref4) <0x362>, _typeobject
+ <1><362>: Abbrev Number: 13 (DW_TAG_structure_type)
+    <363>   DW_AT_name        : (strp) (offset: 0x528): _typeobject
+    <367>   DW_AT_byte_size   : (data2) 416
     <369>   DW_AT_decl_file   : (data1) 14
-    <36a>   DW_AT_decl_line   : (data1) 147
-    <36b>   DW_AT_decl_column : (data1) 5
-    <36c>   DW_AT_type        : (ref4) <0x768>, PyVarObject
-    <370>   DW_AT_data_member_location: (data1) 0
- <2><371>: Abbrev Number: 9 (DW_TAG_member)
-    <372>   DW_AT_name        : (strp) (offset: 0x142): tp_name
-    <376>   DW_AT_decl_file   : (data1) 14
-    <377>   DW_AT_decl_line   : (data1) 148
-    <378>   DW_AT_decl_column : (data1) 17
-    <379>   DW_AT_type        : (ref4) <0x98>, char
-    <37d>   DW_AT_data_member_location: (data1) 24
- <2><37e>: Abbrev Number: 9 (DW_TAG_member)
-    <37f>   DW_AT_name        : (strp) (offset: 0x674): tp_basicsize
-    <383>   DW_AT_decl_file   : (data1) 14
-    <384>   DW_AT_decl_line   : (data1) 149
-    <385>   DW_AT_decl_column : (data1) 16
-    <386>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <38a>   DW_AT_data_member_location: (data1) 32
- <2><38b>: Abbrev Number: 9 (DW_TAG_member)
-    <38c>   DW_AT_name        : (strp) (offset: 0x62c): tp_itemsize
-    <390>   DW_AT_decl_file   : (data1) 14
-    <391>   DW_AT_decl_line   : (data1) 149
-    <392>   DW_AT_decl_column : (data1) 30
-    <393>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <397>   DW_AT_data_member_location: (data1) 40
- <2><398>: Abbrev Number: 9 (DW_TAG_member)
-    <399>   DW_AT_name        : (strp) (offset: 0xcf): tp_dealloc
-    <39d>   DW_AT_decl_file   : (data1) 14
-    <39e>   DW_AT_decl_line   : (data1) 153
-    <39f>   DW_AT_decl_column : (data1) 16
-    <3a0>   DW_AT_type        : (ref4) <0x944>, destructor
-    <3a4>   DW_AT_data_member_location: (data1) 48
- <2><3a5>: Abbrev Number: 9 (DW_TAG_member)
-    <3a6>   DW_AT_name        : (strp) (offset: 0xaff): tp_vectorcall_offset
-    <3aa>   DW_AT_decl_file   : (data1) 14
-    <3ab>   DW_AT_decl_line   : (data1) 154
-    <3ac>   DW_AT_decl_column : (data1) 16
-    <3ad>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <3b1>   DW_AT_data_member_location: (data1) 56
- <2><3b2>: Abbrev Number: 9 (DW_TAG_member)
-    <3b3>   DW_AT_name        : (strp) (offset: 0x257): tp_getattr
-    <3b7>   DW_AT_decl_file   : (data1) 14
-    <3b8>   DW_AT_decl_line   : (data1) 155
-    <3b9>   DW_AT_decl_column : (data1) 17
-    <3ba>   DW_AT_type        : (ref4) <0x962>, getattrfunc, PyObject, _object
-    <3be>   DW_AT_data_member_location: (data1) 64
- <2><3bf>: Abbrev Number: 9 (DW_TAG_member)
-    <3c0>   DW_AT_name        : (strp) (offset: 0xb85): tp_setattr
-    <3c4>   DW_AT_decl_file   : (data1) 14
-    <3c5>   DW_AT_decl_line   : (data1) 156
-    <3c6>   DW_AT_decl_column : (data1) 17
-    <3c7>   DW_AT_type        : (ref4) <0x996>, setattrfunc, int
-    <3cb>   DW_AT_data_member_location: (data1) 72
- <2><3cc>: Abbrev Number: 9 (DW_TAG_member)
-    <3cd>   DW_AT_name        : (strp) (offset: 0x338): tp_as_async
-    <3d1>   DW_AT_decl_file   : (data1) 14
-    <3d2>   DW_AT_decl_line   : (data1) 157
-    <3d3>   DW_AT_decl_column : (data1) 21
-    <3d4>   DW_AT_type        : (ref4) <0xea0>, PyAsyncMethods
-    <3d8>   DW_AT_data_member_location: (data1) 80
- <2><3d9>: Abbrev Number: 9 (DW_TAG_member)
-    <3da>   DW_AT_name        : (strp) (offset: 0x879): tp_repr
-    <3de>   DW_AT_decl_file   : (data1) 14
-    <3df>   DW_AT_decl_line   : (data1) 159
-    <3e0>   DW_AT_decl_column : (data1) 14
-    <3e1>   DW_AT_type        : (ref4) <0x9cf>, reprfunc, PyObject, _object
-    <3e5>   DW_AT_data_member_location: (data1) 88
- <2><3e6>: Abbrev Number: 9 (DW_TAG_member)
-    <3e7>   DW_AT_name        : (strp) (offset: 0xa53): tp_as_number
-    <3eb>   DW_AT_decl_file   : (data1) 14
-    <3ec>   DW_AT_decl_line   : (data1) 163
-    <3ed>   DW_AT_decl_column : (data1) 22
-    <3ee>   DW_AT_type        : (ref4) <0xea6>, PyNumberMethods
-    <3f2>   DW_AT_data_member_location: (data1) 96
- <2><3f3>: Abbrev Number: 9 (DW_TAG_member)
-    <3f4>   DW_AT_name        : (strp) (offset: 0x9bf): tp_as_sequence
-    <3f8>   DW_AT_decl_file   : (data1) 14
-    <3f9>   DW_AT_decl_line   : (data1) 164
-    <3fa>   DW_AT_decl_column : (data1) 24
-    <3fb>   DW_AT_type        : (ref4) <0xeac>, PySequenceMethods
-    <3ff>   DW_AT_data_member_location: (data1) 104
- <2><400>: Abbrev Number: 9 (DW_TAG_member)
-    <401>   DW_AT_name        : (strp) (offset: 0xfd): tp_as_mapping
-    <405>   DW_AT_decl_file   : (data1) 14
-    <406>   DW_AT_decl_line   : (data1) 165
-    <407>   DW_AT_decl_column : (data1) 23
-    <408>   DW_AT_type        : (ref4) <0xeb2>, PyMappingMethods
-    <40c>   DW_AT_data_member_location: (data1) 112
- <2><40d>: Abbrev Number: 9 (DW_TAG_member)
-    <40e>   DW_AT_name        : (strp) (offset: 0x1a): tp_hash
-    <412>   DW_AT_decl_file   : (data1) 14
-    <413>   DW_AT_decl_line   : (data1) 169
-    <414>   DW_AT_decl_column : (data1) 14
-    <415>   DW_AT_type        : (ref4) <0x9dc>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
-    <419>   DW_AT_data_member_location: (data1) 120
- <2><41a>: Abbrev Number: 9 (DW_TAG_member)
-    <41b>   DW_AT_name        : (strp) (offset: 0x759): tp_call
-    <41f>   DW_AT_decl_file   : (data1) 14
-    <420>   DW_AT_decl_line   : (data1) 170
-    <421>   DW_AT_decl_column : (data1) 17
-    <422>   DW_AT_type        : (ref4) <0x7bd>, ternaryfunc, PyObject, _object
-    <426>   DW_AT_data_member_location: (data1) 128
- <2><427>: Abbrev Number: 9 (DW_TAG_member)
-    <428>   DW_AT_name        : (strp) (offset: 0xa16): tp_str
-    <42c>   DW_AT_decl_file   : (data1) 14
-    <42d>   DW_AT_decl_line   : (data1) 171
-    <42e>   DW_AT_decl_column : (data1) 14
-    <42f>   DW_AT_type        : (ref4) <0x9cf>, reprfunc, PyObject, _object
-    <433>   DW_AT_data_member_location: (data1) 136
- <2><434>: Abbrev Number: 9 (DW_TAG_member)
-    <435>   DW_AT_name        : (strp) (offset: 0x323): tp_getattro
-    <439>   DW_AT_decl_file   : (data1) 14
-    <43a>   DW_AT_decl_line   : (data1) 172
-    <43b>   DW_AT_decl_column : (data1) 18
-    <43c>   DW_AT_type        : (ref4) <0x989>, getattrofunc, PyObject, _object
-    <440>   DW_AT_data_member_location: (data1) 144
- <2><441>: Abbrev Number: 9 (DW_TAG_member)
-    <442>   DW_AT_name        : (strp) (offset: 0x58f): tp_setattro
-    <446>   DW_AT_decl_file   : (data1) 14
-    <447>   DW_AT_decl_line   : (data1) 173
-    <448>   DW_AT_decl_column : (data1) 18
-    <449>   DW_AT_type        : (ref4) <0x9c2>, setattrofunc, int
-    <44d>   DW_AT_data_member_location: (data1) 152
- <2><44e>: Abbrev Number: 9 (DW_TAG_member)
-    <44f>   DW_AT_name        : (strp) (offset: 0x184): tp_as_buffer
-    <453>   DW_AT_decl_file   : (data1) 14
-    <454>   DW_AT_decl_line   : (data1) 176
-    <455>   DW_AT_decl_column : (data1) 20
-    <456>   DW_AT_type        : (ref4) <0xeb8>, PyBufferProcs
-    <45a>   DW_AT_data_member_location: (data1) 160
- <2><45b>: Abbrev Number: 9 (DW_TAG_member)
-    <45c>   DW_AT_name        : (strp) (offset: 0x713): tp_flags
-    <460>   DW_AT_decl_file   : (data1) 14
-    <461>   DW_AT_decl_line   : (data1) 179
-    <462>   DW_AT_decl_column : (data1) 19
-    <463>   DW_AT_type        : (ref4) <0x39>, long unsigned int
-    <467>   DW_AT_data_member_location: (data1) 168
- <2><468>: Abbrev Number: 9 (DW_TAG_member)
-    <469>   DW_AT_name        : (strp) (offset: 0x5f3): tp_doc
-    <46d>   DW_AT_decl_file   : (data1) 14
-    <46e>   DW_AT_decl_line   : (data1) 181
-    <46f>   DW_AT_decl_column : (data1) 17
-    <470>   DW_AT_type        : (ref4) <0x98>, char
-    <474>   DW_AT_data_member_location: (data1) 176
- <2><475>: Abbrev Number: 9 (DW_TAG_member)
-    <476>   DW_AT_name        : (strp) (offset: 0x199): tp_traverse
-    <47a>   DW_AT_decl_file   : (data1) 14
-    <47b>   DW_AT_decl_line   : (data1) 185
-    <47c>   DW_AT_decl_column : (data1) 18
-    <47d>   DW_AT_type        : (ref4) <0x8fa>, traverseproc, int
-    <481>   DW_AT_data_member_location: (data1) 184
- <2><482>: Abbrev Number: 9 (DW_TAG_member)
-    <483>   DW_AT_name        : (strp) (offset: 0xa3e): tp_clear
-    <487>   DW_AT_decl_file   : (data1) 14
-    <488>   DW_AT_decl_line   : (data1) 188
-    <489>   DW_AT_decl_column : (data1) 13
-    <48a>   DW_AT_type        : (ref4) <0x7e9>, inquiry, int
-    <48e>   DW_AT_data_member_location: (data1) 192
- <2><48f>: Abbrev Number: 9 (DW_TAG_member)
-    <490>   DW_AT_name        : (strp) (offset: 0x3e8): tp_richcompare
-    <494>   DW_AT_decl_file   : (data1) 14
-    <495>   DW_AT_decl_line   : (data1) 192
-    <496>   DW_AT_decl_column : (data1) 17
-    <497>   DW_AT_type        : (ref4) <0x9fe>, richcmpfunc, PyObject, _object
-    <49b>   DW_AT_data_member_location: (data1) 200
- <2><49c>: Abbrev Number: 9 (DW_TAG_member)
-    <49d>   DW_AT_name        : (strp) (offset: 0x219): tp_weaklistoffset
-    <4a1>   DW_AT_decl_file   : (data1) 14
-    <4a2>   DW_AT_decl_line   : (data1) 195
-    <4a3>   DW_AT_decl_column : (data1) 16
-    <4a4>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <4a8>   DW_AT_data_member_location: (data1) 208
- <2><4a9>: Abbrev Number: 9 (DW_TAG_member)
-    <4aa>   DW_AT_name        : (strp) (offset: 0x2cd): tp_iter
-    <4ae>   DW_AT_decl_file   : (data1) 14
-    <4af>   DW_AT_decl_line   : (data1) 198
-    <4b0>   DW_AT_decl_column : (data1) 17
-    <4b1>   DW_AT_type        : (ref4) <0xa2a>, getiterfunc, PyObject, _object
-    <4b5>   DW_AT_data_member_location: (data1) 216
- <2><4b6>: Abbrev Number: 9 (DW_TAG_member)
-    <4b7>   DW_AT_name        : (strp) (offset: 0x34d): tp_iternext
-    <4bb>   DW_AT_decl_file   : (data1) 14
-    <4bc>   DW_AT_decl_line   : (data1) 199
-    <4bd>   DW_AT_decl_column : (data1) 18
-    <4be>   DW_AT_type        : (ref4) <0xa37>, iternextfunc, PyObject, _object
-    <4c2>   DW_AT_data_member_location: (data1) 224
- <2><4c3>: Abbrev Number: 9 (DW_TAG_member)
-    <4c4>   DW_AT_name        : (strp) (offset: 0x438): tp_methods
-    <4c8>   DW_AT_decl_file   : (data1) 14
-    <4c9>   DW_AT_decl_line   : (data1) 202
-    <4ca>   DW_AT_decl_column : (data1) 18
-    <4cb>   DW_AT_type        : (ref4) <0xebe>, PyMethodDef, PyMethodDef
-    <4cf>   DW_AT_data_member_location: (data1) 232
- <2><4d0>: Abbrev Number: 9 (DW_TAG_member)
-    <4d1>   DW_AT_name        : (strp) (offset: 0x564): tp_members
-    <4d5>   DW_AT_decl_file   : (data1) 14
-    <4d6>   DW_AT_decl_line   : (data1) 203
-    <4d7>   DW_AT_decl_column : (data1) 18
-    <4d8>   DW_AT_type        : (ref4) <0xec4>, PyMemberDef, PyMemberDef
-    <4dc>   DW_AT_data_member_location: (data1) 240
- <2><4dd>: Abbrev Number: 9 (DW_TAG_member)
-    <4de>   DW_AT_name        : (strp) (offset: 0x47c): tp_getset
-    <4e2>   DW_AT_decl_file   : (data1) 14
-    <4e3>   DW_AT_decl_line   : (data1) 204
-    <4e4>   DW_AT_decl_column : (data1) 18
-    <4e5>   DW_AT_type        : (ref4) <0xeca>, PyGetSetDef, PyGetSetDef
-    <4e9>   DW_AT_data_member_location: (data1) 248
- <2><4ea>: Abbrev Number: 14 (DW_TAG_member)
-    <4eb>   DW_AT_name        : (strp) (offset: 0x5a8): tp_base
-    <4ef>   DW_AT_decl_file   : (data1) 14
-    <4f0>   DW_AT_decl_line   : (data1) 206
-    <4f1>   DW_AT_decl_column : (data1) 19
-    <4f2>   DW_AT_type        : (ref4) <0x73e>, PyTypeObject, _typeobject
-    <4f6>   DW_AT_data_member_location: (data2) 256
- <2><4f8>: Abbrev Number: 14 (DW_TAG_member)
-    <4f9>   DW_AT_name        : (strp) (offset: 0x9f3): tp_dict
-    <4fd>   DW_AT_decl_file   : (data1) 14
-    <4fe>   DW_AT_decl_line   : (data1) 207
-    <4ff>   DW_AT_decl_column : (data1) 15
-    <500>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
-    <504>   DW_AT_data_member_location: (data2) 264
- <2><506>: Abbrev Number: 14 (DW_TAG_member)
-    <507>   DW_AT_name        : (strp) (offset: 0x6d9): tp_descr_get
-    <50b>   DW_AT_decl_file   : (data1) 14
-    <50c>   DW_AT_decl_line   : (data1) 208
-    <50d>   DW_AT_decl_column : (data1) 18
-    <50e>   DW_AT_type        : (ref4) <0xa44>, descrgetfunc, PyObject, _object
-    <512>   DW_AT_data_member_location: (data2) 272
- <2><514>: Abbrev Number: 14 (DW_TAG_member)
-    <515>   DW_AT_name        : (strp) (offset: 0xa60): tp_descr_set
-    <519>   DW_AT_decl_file   : (data1) 14
-    <51a>   DW_AT_decl_line   : (data1) 209
-    <51b>   DW_AT_decl_column : (data1) 18
-    <51c>   DW_AT_type        : (ref4) <0xa51>, descrsetfunc, int
-    <520>   DW_AT_data_member_location: (data2) 280
- <2><522>: Abbrev Number: 14 (DW_TAG_member)
-    <523>   DW_AT_name        : (strp) (offset: 0x9e5): tp_dictoffset
-    <527>   DW_AT_decl_file   : (data1) 14
-    <528>   DW_AT_decl_line   : (data1) 210
-    <529>   DW_AT_decl_column : (data1) 16
-    <52a>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <52e>   DW_AT_data_member_location: (data2) 288
- <2><530>: Abbrev Number: 14 (DW_TAG_member)
-    <531>   DW_AT_name        : (strp) (offset: 0x191): tp_init
-    <535>   DW_AT_decl_file   : (data1) 14
-    <536>   DW_AT_decl_line   : (data1) 211
-    <537>   DW_AT_decl_column : (data1) 14
-    <538>   DW_AT_type        : (ref4) <0xa5e>, initproc, int
-    <53c>   DW_AT_data_member_location: (data2) 296
- <2><53e>: Abbrev Number: 14 (DW_TAG_member)
-    <53f>   DW_AT_name        : (strp) (offset: 0x382): tp_alloc
-    <543>   DW_AT_decl_file   : (data1) 14
-    <544>   DW_AT_decl_line   : (data1) 212
-    <545>   DW_AT_decl_column : (data1) 15
-    <546>   DW_AT_type        : (ref4) <0xa97>, allocfunc, PyObject, _object
-    <54a>   DW_AT_data_member_location: (data2) 304
- <2><54c>: Abbrev Number: 14 (DW_TAG_member)
-    <54d>   DW_AT_name        : (strp) (offset: 0xa7a): tp_new
-    <551>   DW_AT_decl_file   : (data1) 14
-    <552>   DW_AT_decl_line   : (data1) 213
-    <553>   DW_AT_decl_column : (data1) 13
-    <554>   DW_AT_type        : (ref4) <0xa6b>, newfunc, PyObject, _object
-    <558>   DW_AT_data_member_location: (data2) 312
- <2><55a>: Abbrev Number: 14 (DW_TAG_member)
-    <55b>   DW_AT_name        : (strp) (offset: 0x769): tp_free
-    <55f>   DW_AT_decl_file   : (data1) 14
-    <560>   DW_AT_decl_line   : (data1) 214
-    <561>   DW_AT_decl_column : (data1) 14
-    <562>   DW_AT_type        : (ref4) <0x926>, freefunc
-    <566>   DW_AT_data_member_location: (data2) 320
- <2><568>: Abbrev Number: 14 (DW_TAG_member)
-    <569>   DW_AT_name        : (strp) (offset: 0x9ad): tp_is_gc
-    <56d>   DW_AT_decl_file   : (data1) 14
-    <56e>   DW_AT_decl_line   : (data1) 215
-    <56f>   DW_AT_decl_column : (data1) 13
-    <570>   DW_AT_type        : (ref4) <0x7e9>, inquiry, int
-    <574>   DW_AT_data_member_location: (data2) 328
- <2><576>: Abbrev Number: 14 (DW_TAG_member)
-    <577>   DW_AT_name        : (strp) (offset: 0x811): tp_bases
-    <57b>   DW_AT_decl_file   : (data1) 14
-    <57c>   DW_AT_decl_line   : (data1) 216
-    <57d>   DW_AT_decl_column : (data1) 15
-    <57e>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
-    <582>   DW_AT_data_member_location: (data2) 336
- <2><584>: Abbrev Number: 14 (DW_TAG_member)
-    <585>   DW_AT_name        : (strp) (offset: 0x424): tp_mro
-    <589>   DW_AT_decl_file   : (data1) 14
-    <58a>   DW_AT_decl_line   : (data1) 217
-    <58b>   DW_AT_decl_column : (data1) 15
-    <58c>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
-    <590>   DW_AT_data_member_location: (data2) 344
- <2><592>: Abbrev Number: 14 (DW_TAG_member)
-    <593>   DW_AT_name        : (strp) (offset: 0x30e): tp_cache
-    <597>   DW_AT_decl_file   : (data1) 14
-    <598>   DW_AT_decl_line   : (data1) 218
-    <599>   DW_AT_decl_column : (data1) 15
-    <59a>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
-    <59e>   DW_AT_data_member_location: (data2) 352
- <2><5a0>: Abbrev Number: 14 (DW_TAG_member)
-    <5a1>   DW_AT_name        : (strp) (offset: 0x456): tp_subclasses
-    <5a5>   DW_AT_decl_file   : (data1) 14
-    <5a6>   DW_AT_decl_line   : (data1) 219
-    <5a7>   DW_AT_decl_column : (data1) 11
-    <5a8>   DW_AT_type        : (ref4) <0x71>
-    <5ac>   DW_AT_data_member_location: (data2) 360
- <2><5ae>: Abbrev Number: 14 (DW_TAG_member)
-    <5af>   DW_AT_name        : (strp) (offset: 0x1e3): tp_weaklist
-    <5b3>   DW_AT_decl_file   : (data1) 14
-    <5b4>   DW_AT_decl_line   : (data1) 220
-    <5b5>   DW_AT_decl_column : (data1) 15
-    <5b6>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
-    <5ba>   DW_AT_data_member_location: (data2) 368
- <2><5bc>: Abbrev Number: 14 (DW_TAG_member)
-    <5bd>   DW_AT_name        : (strp) (offset: 0xb14): tp_del
-    <5c1>   DW_AT_decl_file   : (data1) 14
-    <5c2>   DW_AT_decl_line   : (data1) 221
-    <5c3>   DW_AT_decl_column : (data1) 16
-    <5c4>   DW_AT_type        : (ref4) <0x944>, destructor
-    <5c8>   DW_AT_data_member_location: (data2) 376
- <2><5ca>: Abbrev Number: 14 (DW_TAG_member)
-    <5cb>   DW_AT_name        : (strp) (offset: 0x686): tp_version_tag
-    <5cf>   DW_AT_decl_file   : (data1) 14
-    <5d0>   DW_AT_decl_line   : (data1) 224
-    <5d1>   DW_AT_decl_column : (data1) 18
-    <5d2>   DW_AT_type        : (ref4) <0x55>, unsigned int
-    <5d6>   DW_AT_data_member_location: (data2) 384
- <2><5d8>: Abbrev Number: 14 (DW_TAG_member)
-    <5d9>   DW_AT_name        : (strp) (offset: 0xb46): tp_finalize
-    <5dd>   DW_AT_decl_file   : (data1) 14
-    <5de>   DW_AT_decl_line   : (data1) 226
-    <5df>   DW_AT_decl_column : (data1) 16
-    <5e0>   DW_AT_type        : (ref4) <0x944>, destructor
-    <5e4>   DW_AT_data_member_location: (data2) 392
- <2><5e6>: Abbrev Number: 14 (DW_TAG_member)
-    <5e7>   DW_AT_name        : (strp) (offset: 0x3c1): tp_vectorcall
-    <5eb>   DW_AT_decl_file   : (data1) 14
-    <5ec>   DW_AT_decl_line   : (data1) 227
-    <5ed>   DW_AT_decl_column : (data1) 20
-    <5ee>   DW_AT_type        : (ref4) <0xabe>, vectorcallfunc, PyObject, _object
-    <5f2>   DW_AT_data_member_location: (data2) 400
- <2><5f4>: Abbrev Number: 14 (DW_TAG_member)
-    <5f5>   DW_AT_name        : (strp) (offset: 0x203): tp_watched
-    <5f9>   DW_AT_decl_file   : (data1) 14
-    <5fa>   DW_AT_decl_line   : (data1) 230
-    <5fb>   DW_AT_decl_column : (data1) 19
-    <5fc>   DW_AT_type        : (ref4) <0x47>, unsigned char
-    <600>   DW_AT_data_member_location: (data2) 408
- <2><602>: Abbrev Number: 0
- <1><603>: Abbrev Number: 15 (DW_TAG_structure_type)
-    <604>   DW_AT_byte_size   : (data1) 80
-    <605>   DW_AT_decl_file   : (data1) 15
-    <606>   DW_AT_decl_line   : (data1) 20
-    <607>   DW_AT_decl_column : (data1) 9
-    <608>   DW_AT_sibling     : (ref4) <0x69c>
- <2><60c>: Abbrev Number: 11 (DW_TAG_member)
-    <60d>   DW_AT_name        : (string) buf
+    <36a>   DW_AT_decl_line   : (data1) 146
+    <36b>   DW_AT_decl_column : (data1) 8
+    <36c>   DW_AT_sibling     : (ref4) <0x60f>
+ <2><370>: Abbrev Number: 9 (DW_TAG_member)
+    <371>   DW_AT_name        : (strp) (offset: 0x2ce): ob_base
+    <375>   DW_AT_decl_file   : (data1) 14
+    <376>   DW_AT_decl_line   : (data1) 147
+    <377>   DW_AT_decl_column : (data1) 5
+    <378>   DW_AT_type        : (ref4) <0x774>, PyVarObject
+    <37c>   DW_AT_data_member_location: (data1) 0
+ <2><37d>: Abbrev Number: 9 (DW_TAG_member)
+    <37e>   DW_AT_name        : (strp) (offset: 0x14c): tp_name
+    <382>   DW_AT_decl_file   : (data1) 14
+    <383>   DW_AT_decl_line   : (data1) 148
+    <384>   DW_AT_decl_column : (data1) 17
+    <385>   DW_AT_type        : (ref4) <0x98>, char
+    <389>   DW_AT_data_member_location: (data1) 24
+ <2><38a>: Abbrev Number: 9 (DW_TAG_member)
+    <38b>   DW_AT_name        : (strp) (offset: 0x6d4): tp_basicsize
+    <38f>   DW_AT_decl_file   : (data1) 14
+    <390>   DW_AT_decl_line   : (data1) 149
+    <391>   DW_AT_decl_column : (data1) 16
+    <392>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <396>   DW_AT_data_member_location: (data1) 32
+ <2><397>: Abbrev Number: 9 (DW_TAG_member)
+    <398>   DW_AT_name        : (strp) (offset: 0x68c): tp_itemsize
+    <39c>   DW_AT_decl_file   : (data1) 14
+    <39d>   DW_AT_decl_line   : (data1) 149
+    <39e>   DW_AT_decl_column : (data1) 30
+    <39f>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <3a3>   DW_AT_data_member_location: (data1) 40
+ <2><3a4>: Abbrev Number: 9 (DW_TAG_member)
+    <3a5>   DW_AT_name        : (strp) (offset: 0xd9): tp_dealloc
+    <3a9>   DW_AT_decl_file   : (data1) 14
+    <3aa>   DW_AT_decl_line   : (data1) 153
+    <3ab>   DW_AT_decl_column : (data1) 16
+    <3ac>   DW_AT_type        : (ref4) <0x950>, destructor
+    <3b0>   DW_AT_data_member_location: (data1) 48
+ <2><3b1>: Abbrev Number: 9 (DW_TAG_member)
+    <3b2>   DW_AT_name        : (strp) (offset: 0xb7c): tp_vectorcall_offset
+    <3b6>   DW_AT_decl_file   : (data1) 14
+    <3b7>   DW_AT_decl_line   : (data1) 154
+    <3b8>   DW_AT_decl_column : (data1) 16
+    <3b9>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <3bd>   DW_AT_data_member_location: (data1) 56
+ <2><3be>: Abbrev Number: 9 (DW_TAG_member)
+    <3bf>   DW_AT_name        : (strp) (offset: 0x26a): tp_getattr
+    <3c3>   DW_AT_decl_file   : (data1) 14
+    <3c4>   DW_AT_decl_line   : (data1) 155
+    <3c5>   DW_AT_decl_column : (data1) 17
+    <3c6>   DW_AT_type        : (ref4) <0x96e>, getattrfunc, PyObject, _object
+    <3ca>   DW_AT_data_member_location: (data1) 64
+ <2><3cb>: Abbrev Number: 9 (DW_TAG_member)
+    <3cc>   DW_AT_name        : (strp) (offset: 0xc02): tp_setattr
+    <3d0>   DW_AT_decl_file   : (data1) 14
+    <3d1>   DW_AT_decl_line   : (data1) 156
+    <3d2>   DW_AT_decl_column : (data1) 17
+    <3d3>   DW_AT_type        : (ref4) <0x9a2>, setattrfunc, int
+    <3d7>   DW_AT_data_member_location: (data1) 72
+ <2><3d8>: Abbrev Number: 9 (DW_TAG_member)
+    <3d9>   DW_AT_name        : (strp) (offset: 0x35e): tp_as_async
+    <3dd>   DW_AT_decl_file   : (data1) 14
+    <3de>   DW_AT_decl_line   : (data1) 157
+    <3df>   DW_AT_decl_column : (data1) 21
+    <3e0>   DW_AT_type        : (ref4) <0xeac>, PyAsyncMethods
+    <3e4>   DW_AT_data_member_location: (data1) 80
+ <2><3e5>: Abbrev Number: 9 (DW_TAG_member)
+    <3e6>   DW_AT_name        : (strp) (offset: 0x8d9): tp_repr
+    <3ea>   DW_AT_decl_file   : (data1) 14
+    <3eb>   DW_AT_decl_line   : (data1) 159
+    <3ec>   DW_AT_decl_column : (data1) 14
+    <3ed>   DW_AT_type        : (ref4) <0x9db>, reprfunc, PyObject, _object
+    <3f1>   DW_AT_data_member_location: (data1) 88
+ <2><3f2>: Abbrev Number: 9 (DW_TAG_member)
+    <3f3>   DW_AT_name        : (strp) (offset: 0xad0): tp_as_number
+    <3f7>   DW_AT_decl_file   : (data1) 14
+    <3f8>   DW_AT_decl_line   : (data1) 163
+    <3f9>   DW_AT_decl_column : (data1) 22
+    <3fa>   DW_AT_type        : (ref4) <0xeb2>, PyNumberMethods
+    <3fe>   DW_AT_data_member_location: (data1) 96
+ <2><3ff>: Abbrev Number: 9 (DW_TAG_member)
+    <400>   DW_AT_name        : (strp) (offset: 0xa3c): tp_as_sequence
+    <404>   DW_AT_decl_file   : (data1) 14
+    <405>   DW_AT_decl_line   : (data1) 164
+    <406>   DW_AT_decl_column : (data1) 24
+    <407>   DW_AT_type        : (ref4) <0xeb8>, PySequenceMethods
+    <40b>   DW_AT_data_member_location: (data1) 104
+ <2><40c>: Abbrev Number: 9 (DW_TAG_member)
+    <40d>   DW_AT_name        : (strp) (offset: 0x107): tp_as_mapping
+    <411>   DW_AT_decl_file   : (data1) 14
+    <412>   DW_AT_decl_line   : (data1) 165
+    <413>   DW_AT_decl_column : (data1) 23
+    <414>   DW_AT_type        : (ref4) <0xebe>, PyMappingMethods
+    <418>   DW_AT_data_member_location: (data1) 112
+ <2><419>: Abbrev Number: 9 (DW_TAG_member)
+    <41a>   DW_AT_name        : (strp) (offset: 0x1a): tp_hash
+    <41e>   DW_AT_decl_file   : (data1) 14
+    <41f>   DW_AT_decl_line   : (data1) 169
+    <420>   DW_AT_decl_column : (data1) 14
+    <421>   DW_AT_type        : (ref4) <0x9e8>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
+    <425>   DW_AT_data_member_location: (data1) 120
+ <2><426>: Abbrev Number: 9 (DW_TAG_member)
+    <427>   DW_AT_name        : (strp) (offset: 0x7b9): tp_call
+    <42b>   DW_AT_decl_file   : (data1) 14
+    <42c>   DW_AT_decl_line   : (data1) 170
+    <42d>   DW_AT_decl_column : (data1) 17
+    <42e>   DW_AT_type        : (ref4) <0x7c9>, ternaryfunc, PyObject, _object
+    <432>   DW_AT_data_member_location: (data1) 128
+ <2><433>: Abbrev Number: 9 (DW_TAG_member)
+    <434>   DW_AT_name        : (strp) (offset: 0xa93): tp_str
+    <438>   DW_AT_decl_file   : (data1) 14
+    <439>   DW_AT_decl_line   : (data1) 171
+    <43a>   DW_AT_decl_column : (data1) 14
+    <43b>   DW_AT_type        : (ref4) <0x9db>, reprfunc, PyObject, _object
+    <43f>   DW_AT_data_member_location: (data1) 136
+ <2><440>: Abbrev Number: 9 (DW_TAG_member)
+    <441>   DW_AT_name        : (strp) (offset: 0x349): tp_getattro
+    <445>   DW_AT_decl_file   : (data1) 14
+    <446>   DW_AT_decl_line   : (data1) 172
+    <447>   DW_AT_decl_column : (data1) 18
+    <448>   DW_AT_type        : (ref4) <0x995>, getattrofunc, PyObject, _object
+    <44c>   DW_AT_data_member_location: (data1) 144
+ <2><44d>: Abbrev Number: 9 (DW_TAG_member)
+    <44e>   DW_AT_name        : (strp) (offset: 0x5d9): tp_setattro
+    <452>   DW_AT_decl_file   : (data1) 14
+    <453>   DW_AT_decl_line   : (data1) 173
+    <454>   DW_AT_decl_column : (data1) 18
+    <455>   DW_AT_type        : (ref4) <0x9ce>, setattrofunc, int
+    <459>   DW_AT_data_member_location: (data1) 152
+ <2><45a>: Abbrev Number: 9 (DW_TAG_member)
+    <45b>   DW_AT_name        : (strp) (offset: 0x18e): tp_as_buffer
+    <45f>   DW_AT_decl_file   : (data1) 14
+    <460>   DW_AT_decl_line   : (data1) 176
+    <461>   DW_AT_decl_column : (data1) 20
+    <462>   DW_AT_type        : (ref4) <0xec4>, PyBufferProcs
+    <466>   DW_AT_data_member_location: (data1) 160
+ <2><467>: Abbrev Number: 9 (DW_TAG_member)
+    <468>   DW_AT_name        : (strp) (offset: 0x773): tp_flags
+    <46c>   DW_AT_decl_file   : (data1) 14
+    <46d>   DW_AT_decl_line   : (data1) 179
+    <46e>   DW_AT_decl_column : (data1) 19
+    <46f>   DW_AT_type        : (ref4) <0x39>, long unsigned int
+    <473>   DW_AT_data_member_location: (data1) 168
+ <2><474>: Abbrev Number: 9 (DW_TAG_member)
+    <475>   DW_AT_name        : (strp) (offset: 0x63d): tp_doc
+    <479>   DW_AT_decl_file   : (data1) 14
+    <47a>   DW_AT_decl_line   : (data1) 181
+    <47b>   DW_AT_decl_column : (data1) 17
+    <47c>   DW_AT_type        : (ref4) <0x98>, char
+    <480>   DW_AT_data_member_location: (data1) 176
+ <2><481>: Abbrev Number: 9 (DW_TAG_member)
+    <482>   DW_AT_name        : (strp) (offset: 0x1a3): tp_traverse
+    <486>   DW_AT_decl_file   : (data1) 14
+    <487>   DW_AT_decl_line   : (data1) 185
+    <488>   DW_AT_decl_column : (data1) 18
+    <489>   DW_AT_type        : (ref4) <0x906>, traverseproc, int
+    <48d>   DW_AT_data_member_location: (data1) 184
+ <2><48e>: Abbrev Number: 9 (DW_TAG_member)
+    <48f>   DW_AT_name        : (strp) (offset: 0xabb): tp_clear
+    <493>   DW_AT_decl_file   : (data1) 14
+    <494>   DW_AT_decl_line   : (data1) 188
+    <495>   DW_AT_decl_column : (data1) 13
+    <496>   DW_AT_type        : (ref4) <0x7f5>, inquiry, int
+    <49a>   DW_AT_data_member_location: (data1) 192
+ <2><49b>: Abbrev Number: 9 (DW_TAG_member)
+    <49c>   DW_AT_name        : (strp) (offset: 0x40e): tp_richcompare
+    <4a0>   DW_AT_decl_file   : (data1) 14
+    <4a1>   DW_AT_decl_line   : (data1) 192
+    <4a2>   DW_AT_decl_column : (data1) 17
+    <4a3>   DW_AT_type        : (ref4) <0xa0a>, richcmpfunc, PyObject, _object
+    <4a7>   DW_AT_data_member_location: (data1) 200
+ <2><4a8>: Abbrev Number: 9 (DW_TAG_member)
+    <4a9>   DW_AT_name        : (strp) (offset: 0x22c): tp_weaklistoffset
+    <4ad>   DW_AT_decl_file   : (data1) 14
+    <4ae>   DW_AT_decl_line   : (data1) 195
+    <4af>   DW_AT_decl_column : (data1) 16
+    <4b0>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <4b4>   DW_AT_data_member_location: (data1) 208
+ <2><4b5>: Abbrev Number: 9 (DW_TAG_member)
+    <4b6>   DW_AT_name        : (strp) (offset: 0x2e0): tp_iter
+    <4ba>   DW_AT_decl_file   : (data1) 14
+    <4bb>   DW_AT_decl_line   : (data1) 198
+    <4bc>   DW_AT_decl_column : (data1) 17
+    <4bd>   DW_AT_type        : (ref4) <0xa36>, getiterfunc, PyObject, _object
+    <4c1>   DW_AT_data_member_location: (data1) 216
+ <2><4c2>: Abbrev Number: 9 (DW_TAG_member)
+    <4c3>   DW_AT_name        : (strp) (offset: 0x373): tp_iternext
+    <4c7>   DW_AT_decl_file   : (data1) 14
+    <4c8>   DW_AT_decl_line   : (data1) 199
+    <4c9>   DW_AT_decl_column : (data1) 18
+    <4ca>   DW_AT_type        : (ref4) <0xa43>, iternextfunc, PyObject, _object
+    <4ce>   DW_AT_data_member_location: (data1) 224
+ <2><4cf>: Abbrev Number: 9 (DW_TAG_member)
+    <4d0>   DW_AT_name        : (strp) (offset: 0x45e): tp_methods
+    <4d4>   DW_AT_decl_file   : (data1) 14
+    <4d5>   DW_AT_decl_line   : (data1) 202
+    <4d6>   DW_AT_decl_column : (data1) 18
+    <4d7>   DW_AT_type        : (ref4) <0xeca>, PyMethodDef, PyMethodDef
+    <4db>   DW_AT_data_member_location: (data1) 232
+ <2><4dc>: Abbrev Number: 9 (DW_TAG_member)
+    <4dd>   DW_AT_name        : (strp) (offset: 0x5ae): tp_members
+    <4e1>   DW_AT_decl_file   : (data1) 14
+    <4e2>   DW_AT_decl_line   : (data1) 203
+    <4e3>   DW_AT_decl_column : (data1) 18
+    <4e4>   DW_AT_type        : (ref4) <0xed0>, PyMemberDef, PyMemberDef
+    <4e8>   DW_AT_data_member_location: (data1) 240
+ <2><4e9>: Abbrev Number: 9 (DW_TAG_member)
+    <4ea>   DW_AT_name        : (strp) (offset: 0x76): tp_getset
+    <4ee>   DW_AT_decl_file   : (data1) 14
+    <4ef>   DW_AT_decl_line   : (data1) 204
+    <4f0>   DW_AT_decl_column : (data1) 18
+    <4f1>   DW_AT_type        : (ref4) <0xed6>, PyGetSetDef, PyGetSetDef
+    <4f5>   DW_AT_data_member_location: (data1) 248
+ <2><4f6>: Abbrev Number: 14 (DW_TAG_member)
+    <4f7>   DW_AT_name        : (strp) (offset: 0x5f2): tp_base
+    <4fb>   DW_AT_decl_file   : (data1) 14
+    <4fc>   DW_AT_decl_line   : (data1) 206
+    <4fd>   DW_AT_decl_column : (data1) 19
+    <4fe>   DW_AT_type        : (ref4) <0x74a>, PyTypeObject, _typeobject
+    <502>   DW_AT_data_member_location: (data2) 256
+ <2><504>: Abbrev Number: 14 (DW_TAG_member)
+    <505>   DW_AT_name        : (strp) (offset: 0xa70): tp_dict
+    <509>   DW_AT_decl_file   : (data1) 14
+    <50a>   DW_AT_decl_line   : (data1) 207
+    <50b>   DW_AT_decl_column : (data1) 15
+    <50c>   DW_AT_type        : (ref4) <0x6a8>, PyObject, _object
+    <510>   DW_AT_data_member_location: (data2) 264
+ <2><512>: Abbrev Number: 14 (DW_TAG_member)
+    <513>   DW_AT_name        : (strp) (offset: 0x739): tp_descr_get
+    <517>   DW_AT_decl_file   : (data1) 14
+    <518>   DW_AT_decl_line   : (data1) 208
+    <519>   DW_AT_decl_column : (data1) 18
+    <51a>   DW_AT_type        : (ref4) <0xa50>, descrgetfunc, PyObject, _object
+    <51e>   DW_AT_data_member_location: (data2) 272
+ <2><520>: Abbrev Number: 14 (DW_TAG_member)
+    <521>   DW_AT_name        : (strp) (offset: 0xadd): tp_descr_set
+    <525>   DW_AT_decl_file   : (data1) 14
+    <526>   DW_AT_decl_line   : (data1) 209
+    <527>   DW_AT_decl_column : (data1) 18
+    <528>   DW_AT_type        : (ref4) <0xa5d>, descrsetfunc, int
+    <52c>   DW_AT_data_member_location: (data2) 280
+ <2><52e>: Abbrev Number: 14 (DW_TAG_member)
+    <52f>   DW_AT_name        : (strp) (offset: 0xa62): tp_dictoffset
+    <533>   DW_AT_decl_file   : (data1) 14
+    <534>   DW_AT_decl_line   : (data1) 210
+    <535>   DW_AT_decl_column : (data1) 16
+    <536>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <53a>   DW_AT_data_member_location: (data2) 288
+ <2><53c>: Abbrev Number: 14 (DW_TAG_member)
+    <53d>   DW_AT_name        : (strp) (offset: 0x19b): tp_init
+    <541>   DW_AT_decl_file   : (data1) 14
+    <542>   DW_AT_decl_line   : (data1) 211
+    <543>   DW_AT_decl_column : (data1) 14
+    <544>   DW_AT_type        : (ref4) <0xa6a>, initproc, int
+    <548>   DW_AT_data_member_location: (data2) 296
+ <2><54a>: Abbrev Number: 14 (DW_TAG_member)
+    <54b>   DW_AT_name        : (strp) (offset: 0x3a8): tp_alloc
+    <54f>   DW_AT_decl_file   : (data1) 14
+    <550>   DW_AT_decl_line   : (data1) 212
+    <551>   DW_AT_decl_column : (data1) 15
+    <552>   DW_AT_type        : (ref4) <0xaa3>, allocfunc, PyObject, _object
+    <556>   DW_AT_data_member_location: (data2) 304
+ <2><558>: Abbrev Number: 14 (DW_TAG_member)
+    <559>   DW_AT_name        : (strp) (offset: 0xaf7): tp_new
+    <55d>   DW_AT_decl_file   : (data1) 14
+    <55e>   DW_AT_decl_line   : (data1) 213
+    <55f>   DW_AT_decl_column : (data1) 13
+    <560>   DW_AT_type        : (ref4) <0xa77>, newfunc, PyObject, _object
+    <564>   DW_AT_data_member_location: (data2) 312
+ <2><566>: Abbrev Number: 14 (DW_TAG_member)
+    <567>   DW_AT_name        : (strp) (offset: 0x7c9): tp_free
+    <56b>   DW_AT_decl_file   : (data1) 14
+    <56c>   DW_AT_decl_line   : (data1) 214
+    <56d>   DW_AT_decl_column : (data1) 14
+    <56e>   DW_AT_type        : (ref4) <0x932>, freefunc
+    <572>   DW_AT_data_member_location: (data2) 320
+ <2><574>: Abbrev Number: 14 (DW_TAG_member)
+    <575>   DW_AT_name        : (strp) (offset: 0xa17): tp_is_gc
+    <579>   DW_AT_decl_file   : (data1) 14
+    <57a>   DW_AT_decl_line   : (data1) 215
+    <57b>   DW_AT_decl_column : (data1) 13
+    <57c>   DW_AT_type        : (ref4) <0x7f5>, inquiry, int
+    <580>   DW_AT_data_member_location: (data2) 328
+ <2><582>: Abbrev Number: 14 (DW_TAG_member)
+    <583>   DW_AT_name        : (strp) (offset: 0x871): tp_bases
+    <587>   DW_AT_decl_file   : (data1) 14
+    <588>   DW_AT_decl_line   : (data1) 216
+    <589>   DW_AT_decl_column : (data1) 15
+    <58a>   DW_AT_type        : (ref4) <0x6a8>, PyObject, _object
+    <58e>   DW_AT_data_member_location: (data2) 336
+ <2><590>: Abbrev Number: 14 (DW_TAG_member)
+    <591>   DW_AT_name        : (strp) (offset: 0x44a): tp_mro
+    <595>   DW_AT_decl_file   : (data1) 14
+    <596>   DW_AT_decl_line   : (data1) 217
+    <597>   DW_AT_decl_column : (data1) 15
+    <598>   DW_AT_type        : (ref4) <0x6a8>, PyObject, _object
+    <59c>   DW_AT_data_member_location: (data2) 344
+ <2><59e>: Abbrev Number: 14 (DW_TAG_member)
+    <59f>   DW_AT_name        : (strp) (offset: 0x334): tp_cache
+    <5a3>   DW_AT_decl_file   : (data1) 14
+    <5a4>   DW_AT_decl_line   : (data1) 218
+    <5a5>   DW_AT_decl_column : (data1) 15
+    <5a6>   DW_AT_type        : (ref4) <0x6a8>, PyObject, _object
+    <5aa>   DW_AT_data_member_location: (data2) 352
+ <2><5ac>: Abbrev Number: 14 (DW_TAG_member)
+    <5ad>   DW_AT_name        : (strp) (offset: 0x488): tp_subclasses
+    <5b1>   DW_AT_decl_file   : (data1) 14
+    <5b2>   DW_AT_decl_line   : (data1) 219
+    <5b3>   DW_AT_decl_column : (data1) 11
+    <5b4>   DW_AT_type        : (ref4) <0x71>
+    <5b8>   DW_AT_data_member_location: (data2) 360
+ <2><5ba>: Abbrev Number: 14 (DW_TAG_member)
+    <5bb>   DW_AT_name        : (strp) (offset: 0x1f6): tp_weaklist
+    <5bf>   DW_AT_decl_file   : (data1) 14
+    <5c0>   DW_AT_decl_line   : (data1) 220
+    <5c1>   DW_AT_decl_column : (data1) 15
+    <5c2>   DW_AT_type        : (ref4) <0x6a8>, PyObject, _object
+    <5c6>   DW_AT_data_member_location: (data2) 368
+ <2><5c8>: Abbrev Number: 14 (DW_TAG_member)
+    <5c9>   DW_AT_name        : (strp) (offset: 0xb91): tp_del
+    <5cd>   DW_AT_decl_file   : (data1) 14
+    <5ce>   DW_AT_decl_line   : (data1) 221
+    <5cf>   DW_AT_decl_column : (data1) 16
+    <5d0>   DW_AT_type        : (ref4) <0x950>, destructor
+    <5d4>   DW_AT_data_member_location: (data2) 376
+ <2><5d6>: Abbrev Number: 14 (DW_TAG_member)
+    <5d7>   DW_AT_name        : (strp) (offset: 0x6e6): tp_version_tag
+    <5db>   DW_AT_decl_file   : (data1) 14
+    <5dc>   DW_AT_decl_line   : (data1) 224
+    <5dd>   DW_AT_decl_column : (data1) 18
+    <5de>   DW_AT_type        : (ref4) <0x55>, unsigned int
+    <5e2>   DW_AT_data_member_location: (data2) 384
+ <2><5e4>: Abbrev Number: 14 (DW_TAG_member)
+    <5e5>   DW_AT_name        : (strp) (offset: 0xbc3): tp_finalize
+    <5e9>   DW_AT_decl_file   : (data1) 14
+    <5ea>   DW_AT_decl_line   : (data1) 226
+    <5eb>   DW_AT_decl_column : (data1) 16
+    <5ec>   DW_AT_type        : (ref4) <0x950>, destructor
+    <5f0>   DW_AT_data_member_location: (data2) 392
+ <2><5f2>: Abbrev Number: 14 (DW_TAG_member)
+    <5f3>   DW_AT_name        : (strp) (offset: 0x3e7): tp_vectorcall
+    <5f7>   DW_AT_decl_file   : (data1) 14
+    <5f8>   DW_AT_decl_line   : (data1) 227
+    <5f9>   DW_AT_decl_column : (data1) 20
+    <5fa>   DW_AT_type        : (ref4) <0xaca>, vectorcallfunc, PyObject, _object
+    <5fe>   DW_AT_data_member_location: (data2) 400
+ <2><600>: Abbrev Number: 14 (DW_TAG_member)
+    <601>   DW_AT_name        : (strp) (offset: 0x216): tp_watched
+    <605>   DW_AT_decl_file   : (data1) 14
+    <606>   DW_AT_decl_line   : (data1) 230
+    <607>   DW_AT_decl_column : (data1) 19
+    <608>   DW_AT_type        : (ref4) <0x47>, unsigned char
+    <60c>   DW_AT_data_member_location: (data2) 408
+ <2><60e>: Abbrev Number: 0
+ <1><60f>: Abbrev Number: 15 (DW_TAG_structure_type)
+    <610>   DW_AT_byte_size   : (data1) 80
     <611>   DW_AT_decl_file   : (data1) 15
-    <612>   DW_AT_decl_line   : (data1) 21
-    <613>   DW_AT_decl_column : (data1) 11
-    <614>   DW_AT_type        : (ref4) <0x71>
-    <618>   DW_AT_data_member_location: (data1) 0
- <2><619>: Abbrev Number: 11 (DW_TAG_member)
-    <61a>   DW_AT_name        : (string) obj
-    <61e>   DW_AT_decl_file   : (data1) 15
-    <61f>   DW_AT_decl_line   : (data1) 22
-    <620>   DW_AT_decl_column : (data1) 15
-    <621>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
-    <625>   DW_AT_data_member_location: (data1) 8
- <2><626>: Abbrev Number: 11 (DW_TAG_member)
-    <627>   DW_AT_name        : (string) len
-    <62b>   DW_AT_decl_file   : (data1) 15
-    <62c>   DW_AT_decl_line   : (data1) 23
-    <62d>   DW_AT_decl_column : (data1) 16
-    <62e>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <632>   DW_AT_data_member_location: (data1) 16
- <2><633>: Abbrev Number: 9 (DW_TAG_member)
-    <634>   DW_AT_name        : (strp) (offset: 0x62f): itemsize
-    <638>   DW_AT_decl_file   : (data1) 15
-    <639>   DW_AT_decl_line   : (data1) 24
-    <63a>   DW_AT_decl_column : (data1) 16
-    <63b>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <63f>   DW_AT_data_member_location: (data1) 24
- <2><640>: Abbrev Number: 9 (DW_TAG_member)
-    <641>   DW_AT_name        : (strp) (offset: 0xf4): readonly
-    <645>   DW_AT_decl_file   : (data1) 15
-    <646>   DW_AT_decl_line   : (data1) 26
-    <647>   DW_AT_decl_column : (data1) 9
-    <648>   DW_AT_type        : (ref4) <0x40>, int
-    <64c>   DW_AT_data_member_location: (data1) 32
- <2><64d>: Abbrev Number: 9 (DW_TAG_member)
-    <64e>   DW_AT_name        : (strp) (offset: 0x771): ndim
-    <652>   DW_AT_decl_file   : (data1) 15
-    <653>   DW_AT_decl_line   : (data1) 27
-    <654>   DW_AT_decl_column : (data1) 9
-    <655>   DW_AT_type        : (ref4) <0x40>, int
-    <659>   DW_AT_data_member_location: (data1) 36
- <2><65a>: Abbrev Number: 9 (DW_TAG_member)
-    <65b>   DW_AT_name        : (strp) (offset: 0x80): format
-    <65f>   DW_AT_decl_file   : (data1) 15
-    <660>   DW_AT_decl_line   : (data1) 28
-    <661>   DW_AT_decl_column : (data1) 11
-    <662>   DW_AT_type        : (ref4) <0x7f>, char
-    <666>   DW_AT_data_member_location: (data1) 40
- <2><667>: Abbrev Number: 9 (DW_TAG_member)
-    <668>   DW_AT_name        : (strp) (offset: 0x3e2): shape
-    <66c>   DW_AT_decl_file   : (data1) 15
-    <66d>   DW_AT_decl_line   : (data1) 29
-    <66e>   DW_AT_decl_column : (data1) 17
-    <66f>   DW_AT_type        : (ref4) <0x6a7>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <673>   DW_AT_data_member_location: (data1) 48
- <2><674>: Abbrev Number: 9 (DW_TAG_member)
-    <675>   DW_AT_name        : (strp) (offset: 0x3e): strides
-    <679>   DW_AT_decl_file   : (data1) 15
-    <67a>   DW_AT_decl_line   : (data1) 30
-    <67b>   DW_AT_decl_column : (data1) 17
-    <67c>   DW_AT_type        : (ref4) <0x6a7>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <680>   DW_AT_data_member_location: (data1) 56
- <2><681>: Abbrev Number: 9 (DW_TAG_member)
-    <682>   DW_AT_name        : (strp) (offset: 0xa26): suboffsets
-    <686>   DW_AT_decl_file   : (data1) 15
-    <687>   DW_AT_decl_line   : (data1) 31
-    <688>   DW_AT_decl_column : (data1) 17
-    <689>   DW_AT_type        : (ref4) <0x6a7>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <68d>   DW_AT_data_member_location: (data1) 64
- <2><68e>: Abbrev Number: 9 (DW_TAG_member)
-    <68f>   DW_AT_name        : (strp) (offset: 0x492): internal
-    <693>   DW_AT_decl_file   : (data1) 15
-    <694>   DW_AT_decl_line   : (data1) 32
-    <695>   DW_AT_decl_column : (data1) 11
-    <696>   DW_AT_type        : (ref4) <0x71>
-    <69a>   DW_AT_data_member_location: (data1) 72
- <2><69b>: Abbrev Number: 0
- <1><69c>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <69d>   DW_AT_byte_size   : (data1) 8
-    <69e>   DW_AT_type        : (ref4) <0x2e9>, PyObject, _object
- <1><6a2>: Abbrev Number: 7 (DW_TAG_const_type)
-    <6a3>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <1><6a7>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <6a8>   DW_AT_byte_size   : (data1) 8
-    <6a9>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><6ad>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6ae>   DW_AT_name        : (strp) (offset: 0x49b): Py_buffer
-    <6b2>   DW_AT_decl_file   : (data1) 15
-    <6b3>   DW_AT_decl_line   : (data1) 33
-    <6b4>   DW_AT_decl_column : (data1) 3
-    <6b5>   DW_AT_type        : (ref4) <0x603>
+    <612>   DW_AT_decl_line   : (data1) 20
+    <613>   DW_AT_decl_column : (data1) 9
+    <614>   DW_AT_sibling     : (ref4) <0x6a8>
+ <2><618>: Abbrev Number: 11 (DW_TAG_member)
+    <619>   DW_AT_name        : (string) buf
+    <61d>   DW_AT_decl_file   : (data1) 15
+    <61e>   DW_AT_decl_line   : (data1) 21
+    <61f>   DW_AT_decl_column : (data1) 11
+    <620>   DW_AT_type        : (ref4) <0x71>
+    <624>   DW_AT_data_member_location: (data1) 0
+ <2><625>: Abbrev Number: 11 (DW_TAG_member)
+    <626>   DW_AT_name        : (string) obj
+    <62a>   DW_AT_decl_file   : (data1) 15
+    <62b>   DW_AT_decl_line   : (data1) 22
+    <62c>   DW_AT_decl_column : (data1) 15
+    <62d>   DW_AT_type        : (ref4) <0x6a8>, PyObject, _object
+    <631>   DW_AT_data_member_location: (data1) 8
+ <2><632>: Abbrev Number: 11 (DW_TAG_member)
+    <633>   DW_AT_name        : (string) len
+    <637>   DW_AT_decl_file   : (data1) 15
+    <638>   DW_AT_decl_line   : (data1) 23
+    <639>   DW_AT_decl_column : (data1) 16
+    <63a>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <63e>   DW_AT_data_member_location: (data1) 16
+ <2><63f>: Abbrev Number: 9 (DW_TAG_member)
+    <640>   DW_AT_name        : (strp) (offset: 0x68f): itemsize
+    <644>   DW_AT_decl_file   : (data1) 15
+    <645>   DW_AT_decl_line   : (data1) 24
+    <646>   DW_AT_decl_column : (data1) 16
+    <647>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <64b>   DW_AT_data_member_location: (data1) 24
+ <2><64c>: Abbrev Number: 9 (DW_TAG_member)
+    <64d>   DW_AT_name        : (strp) (offset: 0xfe): readonly
+    <651>   DW_AT_decl_file   : (data1) 15
+    <652>   DW_AT_decl_line   : (data1) 26
+    <653>   DW_AT_decl_column : (data1) 9
+    <654>   DW_AT_type        : (ref4) <0x40>, int
+    <658>   DW_AT_data_member_location: (data1) 32
+ <2><659>: Abbrev Number: 9 (DW_TAG_member)
+    <65a>   DW_AT_name        : (strp) (offset: 0x7d1): ndim
+    <65e>   DW_AT_decl_file   : (data1) 15
+    <65f>   DW_AT_decl_line   : (data1) 27
+    <660>   DW_AT_decl_column : (data1) 9
+    <661>   DW_AT_type        : (ref4) <0x40>, int
+    <665>   DW_AT_data_member_location: (data1) 36
+ <2><666>: Abbrev Number: 9 (DW_TAG_member)
+    <667>   DW_AT_name        : (strp) (offset: 0x8a): format
+    <66b>   DW_AT_decl_file   : (data1) 15
+    <66c>   DW_AT_decl_line   : (data1) 28
+    <66d>   DW_AT_decl_column : (data1) 11
+    <66e>   DW_AT_type        : (ref4) <0x7f>, char
+    <672>   DW_AT_data_member_location: (data1) 40
+ <2><673>: Abbrev Number: 9 (DW_TAG_member)
+    <674>   DW_AT_name        : (strp) (offset: 0x408): shape
+    <678>   DW_AT_decl_file   : (data1) 15
+    <679>   DW_AT_decl_line   : (data1) 29
+    <67a>   DW_AT_decl_column : (data1) 17
+    <67b>   DW_AT_type        : (ref4) <0x6b3>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <67f>   DW_AT_data_member_location: (data1) 48
+ <2><680>: Abbrev Number: 9 (DW_TAG_member)
+    <681>   DW_AT_name        : (strp) (offset: 0x3e): strides
+    <685>   DW_AT_decl_file   : (data1) 15
+    <686>   DW_AT_decl_line   : (data1) 30
+    <687>   DW_AT_decl_column : (data1) 17
+    <688>   DW_AT_type        : (ref4) <0x6b3>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <68c>   DW_AT_data_member_location: (data1) 56
+ <2><68d>: Abbrev Number: 9 (DW_TAG_member)
+    <68e>   DW_AT_name        : (strp) (offset: 0xaa3): suboffsets
+    <692>   DW_AT_decl_file   : (data1) 15
+    <693>   DW_AT_decl_line   : (data1) 31
+    <694>   DW_AT_decl_column : (data1) 17
+    <695>   DW_AT_type        : (ref4) <0x6b3>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <699>   DW_AT_data_member_location: (data1) 64
+ <2><69a>: Abbrev Number: 9 (DW_TAG_member)
+    <69b>   DW_AT_name        : (strp) (offset: 0x4dc): internal
+    <69f>   DW_AT_decl_file   : (data1) 15
+    <6a0>   DW_AT_decl_line   : (data1) 32
+    <6a1>   DW_AT_decl_column : (data1) 11
+    <6a2>   DW_AT_type        : (ref4) <0x71>
+    <6a6>   DW_AT_data_member_location: (data1) 72
+ <2><6a7>: Abbrev Number: 0
+ <1><6a8>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6a9>   DW_AT_byte_size   : (data1) 8
+    <6aa>   DW_AT_type        : (ref4) <0x2f5>, PyObject, _object
+ <1><6ae>: Abbrev Number: 7 (DW_TAG_const_type)
+    <6af>   DW_AT_type        : (ref4) <0x6a8>, PyObject, _object
+ <1><6b3>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6b4>   DW_AT_byte_size   : (data1) 8
+    <6b5>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><6b9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6ba>   DW_AT_name        : (strp) (offset: 0xaea): getbufferproc
+    <6ba>   DW_AT_name        : (strp) (offset: 0x4e5): Py_buffer
     <6be>   DW_AT_decl_file   : (data1) 15
-    <6bf>   DW_AT_decl_line   : (data1) 35
-    <6c0>   DW_AT_decl_column : (data1) 15
-    <6c1>   DW_AT_type        : (ref4) <0x6c5>, int
- <1><6c5>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <6c6>   DW_AT_byte_size   : (data1) 8
-    <6c7>   DW_AT_type        : (ref4) <0x6cb>, int
- <1><6cb>: Abbrev Number: 16 (DW_TAG_subroutine_type)
-    <6cc>   DW_AT_prototyped  : (flag_present) 1
-    <6cc>   DW_AT_type        : (ref4) <0x40>, int
-    <6d0>   DW_AT_sibling     : (ref4) <0x6e4>
- <2><6d4>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <6d5>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <2><6d9>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <6da>   DW_AT_type        : (ref4) <0x6e4>, Py_buffer
- <2><6de>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <6df>   DW_AT_type        : (ref4) <0x40>, int
- <2><6e3>: Abbrev Number: 0
- <1><6e4>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <6e5>   DW_AT_byte_size   : (data1) 8
-    <6e6>   DW_AT_type        : (ref4) <0x6ad>, Py_buffer
- <1><6ea>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6eb>   DW_AT_name        : (strp) (offset: 0x3af): releasebufferproc
-    <6ef>   DW_AT_decl_file   : (data1) 15
-    <6f0>   DW_AT_decl_line   : (data1) 36
-    <6f1>   DW_AT_decl_column : (data1) 16
-    <6f2>   DW_AT_type        : (ref4) <0x6f6>
- <1><6f6>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <6f7>   DW_AT_byte_size   : (data1) 8
-    <6f8>   DW_AT_type        : (ref4) <0x6fc>
- <1><6fc>: Abbrev Number: 18 (DW_TAG_subroutine_type)
-    <6fd>   DW_AT_prototyped  : (flag_present) 1
-    <6fd>   DW_AT_sibling     : (ref4) <0x70c>
- <2><701>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <702>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <2><706>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <707>   DW_AT_type        : (ref4) <0x6e4>, Py_buffer
- <2><70b>: Abbrev Number: 0
- <1><70c>: Abbrev Number: 19 (DW_TAG_union_type)
-    <70d>   DW_AT_byte_size   : (data1) 8
-    <70e>   DW_AT_decl_file   : (data1) 1
-    <70f>   DW_AT_decl_line   : (data1) 180
-    <710>   DW_AT_decl_column : (data1) 5
-    <711>   DW_AT_sibling     : (ref4) <0x72e>
- <2><715>: Abbrev Number: 20 (DW_TAG_member)
-    <716>   DW_AT_name        : (strp) (offset: 0x776): ob_refcnt
+    <6bf>   DW_AT_decl_line   : (data1) 33
+    <6c0>   DW_AT_decl_column : (data1) 3
+    <6c1>   DW_AT_type        : (ref4) <0x60f>
+ <1><6c5>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6c6>   DW_AT_name        : (strp) (offset: 0xb67): getbufferproc
+    <6ca>   DW_AT_decl_file   : (data1) 15
+    <6cb>   DW_AT_decl_line   : (data1) 35
+    <6cc>   DW_AT_decl_column : (data1) 15
+    <6cd>   DW_AT_type        : (ref4) <0x6d1>, int
+ <1><6d1>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6d2>   DW_AT_byte_size   : (data1) 8
+    <6d3>   DW_AT_type        : (ref4) <0x6d7>, int
+ <1><6d7>: Abbrev Number: 16 (DW_TAG_subroutine_type)
+    <6d8>   DW_AT_prototyped  : (flag_present) 1
+    <6d8>   DW_AT_type        : (ref4) <0x40>, int
+    <6dc>   DW_AT_sibling     : (ref4) <0x6f0>
+ <2><6e0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
+    <6e1>   DW_AT_type        : (ref4) <0x6a8>, PyObject, _object
+ <2><6e5>: Abbrev Number: 17 (DW_TAG_formal_parameter)
+    <6e6>   DW_AT_type        : (ref4) <0x6f0>, Py_buffer
+ <2><6ea>: Abbrev Number: 17 (DW_TAG_formal_parameter)
+    <6eb>   DW_AT_type        : (ref4) <0x40>, int
+ <2><6ef>: Abbrev Number: 0
+ <1><6f0>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6f1>   DW_AT_byte_size   : (data1) 8
+    <6f2>   DW_AT_type        : (ref4) <0x6b9>, Py_buffer
+ <1><6f6>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6f7>   DW_AT_name        : (strp) (offset: 0x3d5): releasebufferproc
+    <6fb>   DW_AT_decl_file   : (data1) 15
+    <6fc>   DW_AT_decl_line   : (data1) 36
+    <6fd>   DW_AT_decl_column : (data1) 16
+    <6fe>   DW_AT_type        : (ref4) <0x702>
+ <1><702>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <703>   DW_AT_byte_size   : (data1) 8
+    <704>   DW_AT_type        : (ref4) <0x708>
+ <1><708>: Abbrev Number: 18 (DW_TAG_subroutine_type)
+    <709>   DW_AT_prototyped  : (flag_present) 1
+    <709>   DW_AT_sibling     : (ref4) <0x718>
+ <2><70d>: Abbrev Number: 17 (DW_TAG_formal_parameter)
+    <70e>   DW_AT_type        : (ref4) <0x6a8>, PyObject, _object
+ <2><712>: Abbrev Number: 17 (DW_TAG_formal_parameter)
+    <713>   DW_AT_type        : (ref4) <0x6f0>, Py_buffer
+ <2><717>: Abbrev Number: 0
+ <1><718>: Abbrev Number: 19 (DW_TAG_union_type)
+    <719>   DW_AT_byte_size   : (data1) 8
     <71a>   DW_AT_decl_file   : (data1) 1
-    <71b>   DW_AT_decl_line   : (data1) 181
-    <71c>   DW_AT_decl_column : (data1) 19
-    <71d>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <71b>   DW_AT_decl_line   : (data1) 180
+    <71c>   DW_AT_decl_column : (data1) 5
+    <71d>   DW_AT_sibling     : (ref4) <0x73a>
  <2><721>: Abbrev Number: 20 (DW_TAG_member)
-    <722>   DW_AT_name        : (strp) (offset: 0xb6d): ob_refcnt_split
+    <722>   DW_AT_name        : (strp) (offset: 0x7d6): ob_refcnt
     <726>   DW_AT_decl_file   : (data1) 1
-    <727>   DW_AT_decl_line   : (data1) 183
-    <728>   DW_AT_decl_column : (data1) 20
-    <729>   DW_AT_type        : (ref4) <0x72e>, uint32_t, unsigned int
- <2><72d>: Abbrev Number: 0
- <1><72e>: Abbrev Number: 21 (DW_TAG_array_type)
-    <72f>   DW_AT_type        : (ref4) <0xb1>, uint32_t, unsigned int
-    <733>   DW_AT_sibling     : (ref4) <0x73e>
- <2><737>: Abbrev Number: 22 (DW_TAG_subrange_type)
-    <738>   DW_AT_type        : (ref4) <0x39>, long unsigned int
-    <73c>   DW_AT_upper_bound : (data1) 1
- <2><73d>: Abbrev Number: 0
- <1><73e>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <73f>   DW_AT_byte_size   : (data1) 8
-    <740>   DW_AT_type        : (ref4) <0x34a>, PyTypeObject, _typeobject
- <1><744>: Abbrev Number: 15 (DW_TAG_structure_type)
-    <745>   DW_AT_byte_size   : (data1) 24
-    <746>   DW_AT_decl_file   : (data1) 1
-    <747>   DW_AT_decl_line   : (data1) 196
-    <748>   DW_AT_decl_column : (data1) 9
-    <749>   DW_AT_sibling     : (ref4) <0x768>
- <2><74d>: Abbrev Number: 9 (DW_TAG_member)
-    <74e>   DW_AT_name        : (strp) (offset: 0x2bb): ob_base
+    <727>   DW_AT_decl_line   : (data1) 181
+    <728>   DW_AT_decl_column : (data1) 19
+    <729>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <2><72d>: Abbrev Number: 20 (DW_TAG_member)
+    <72e>   DW_AT_name        : (strp) (offset: 0xbea): ob_refcnt_split
+    <732>   DW_AT_decl_file   : (data1) 1
+    <733>   DW_AT_decl_line   : (data1) 183
+    <734>   DW_AT_decl_column : (data1) 20
+    <735>   DW_AT_type        : (ref4) <0x73a>, uint32_t, unsigned int
+ <2><739>: Abbrev Number: 0
+ <1><73a>: Abbrev Number: 21 (DW_TAG_array_type)
+    <73b>   DW_AT_type        : (ref4) <0xbd>, uint32_t, unsigned int
+    <73f>   DW_AT_sibling     : (ref4) <0x74a>
+ <2><743>: Abbrev Number: 22 (DW_TAG_subrange_type)
+    <744>   DW_AT_type        : (ref4) <0x39>, long unsigned int
+    <748>   DW_AT_upper_bound : (data1) 1
+ <2><749>: Abbrev Number: 0
+ <1><74a>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <74b>   DW_AT_byte_size   : (data1) 8
+    <74c>   DW_AT_type        : (ref4) <0x356>, PyTypeObject, _typeobject
+ <1><750>: Abbrev Number: 15 (DW_TAG_structure_type)
+    <751>   DW_AT_byte_size   : (data1) 24
     <752>   DW_AT_decl_file   : (data1) 1
-    <753>   DW_AT_decl_line   : (data1) 197
-    <754>   DW_AT_decl_column : (data1) 14
-    <755>   DW_AT_type        : (ref4) <0x2e9>, PyObject, _object
-    <759>   DW_AT_data_member_location: (data1) 0
- <2><75a>: Abbrev Number: 9 (DW_TAG_member)
-    <75b>   DW_AT_name        : (strp) (offset: 0x71c): ob_size
-    <75f>   DW_AT_decl_file   : (data1) 1
-    <760>   DW_AT_decl_line   : (data1) 198
-    <761>   DW_AT_decl_column : (data1) 16
-    <762>   DW_AT_type        : (ref4) <0xc9>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <766>   DW_AT_data_member_location: (data1) 16
- <2><767>: Abbrev Number: 0
- <1><768>: Abbrev Number: 2 (DW_TAG_typedef)
-    <769>   DW_AT_name        : (strp) (offset: 0x6c1): PyVarObject
-    <76d>   DW_AT_decl_file   : (data1) 1
-    <76e>   DW_AT_decl_line   : (data1) 199
-    <76f>   DW_AT_decl_column : (data1) 3
-    <770>   DW_AT_type        : (ref4) <0x744>
- <1><774>: Abbrev Number: 23 (DW_TAG_typedef)
-    <775>   DW_AT_name        : (strp) (offset: 0xbb3): unaryfunc
+    <753>   DW_AT_decl_line   : (data1) 196
+    <754>   DW_AT_decl_column : (data1) 9
+    <755>   DW_AT_sibling     : (ref4) <0x774>
+ <2><759>: Abbrev Number: 9 (DW_TAG_member)
+    <75a>   DW_AT_name        : (strp) (offset: 0x2ce): ob_base
+    <75e>   DW_AT_decl_file   : (data1) 1
+    <75f>   DW_AT_decl_line   : (data1) 197
+    <760>   DW_AT_decl_column : (data1) 14
+    <761>   DW_AT_type        : (ref4) <0x2f5>, PyObject, _object
+    <765>   DW_AT_data_member_location: (data1) 0
+ <2><766>: Abbrev Number: 9 (DW_TAG_member)
+    <767>   DW_AT_name        : (strp) (offset: 0x77c): ob_size
+    <76b>   DW_AT_decl_file   : (data1) 1
+    <76c>   DW_AT_decl_line   : (data1) 198
+    <76d>   DW_AT_decl_column : (data1) 16
+    <76e>   DW_AT_type        : (ref4) <0xd5>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <772>   DW_AT_data_member_location: (data1) 16
+ <2><773>: Abbrev Number: 0
+ <1><774>: Abbrev Number: 2 (DW_TAG_typedef)
+    <775>   DW_AT_name        : (strp) (offset: 0x721): PyVarObject
     <779>   DW_AT_decl_file   : (data1) 1
-    <77a>   DW_AT_decl_line   : (data2) 304
-    <77c>   DW_AT_decl_column : (data1) 22
-    <77d>   DW_AT_type        : (ref4) <0x781>, PyObject, _object
- <1><781>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <782>   DW_AT_byte_size   : (data1) 8
-    <783>   DW_AT_type        : (ref4) <0x787>, PyObject, _object
- <1><787>: Abbrev Number: 16 (DW_TAG_subroutine_type)
-    <788>   DW_AT_prototyped  : (flag_present) 1
-    <788>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
-    <78c>   DW_AT_sibling     : (ref4) <0x796>
- <2><790>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <791>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <2><795>: Abbrev Number: 0
- <1><796>: Abbrev Number: 23 (DW_TAG_typedef)
-    <797>   DW_AT_name        : (strp) (offset: 0x33): binaryfunc
-    <79b>   DW_AT_decl_file   : (data1) 1
-    <79c>   DW_AT_decl_line   : (data2) 305
-    <79e>   DW_AT_decl_column : (data1) 22
-    <79f>   DW_AT_type        : (ref4) <0x7a3>, PyObject, _object
- <1><7a3>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <7a4>   DW_AT_byte_size   : (data1) 8
-    <7a5>   DW_AT_type        : (ref4) <0x7a9>, PyObject, _object
- <1><7a9>: Abbrev Number: 16 (DW_TAG_subroutine_type)
-    <7aa>   DW_AT_prototyped  : (flag_present) 1
-    <7aa>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
-    <7ae>   DW_AT_sibling     : (ref4) <0x7bd>
- <2><7b2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <7b3>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <2><7b7>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <7b8>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <2><7bc>: Abbrev Number: 0
- <1><7bd>: Abbrev Number: 23 (DW_TAG_typedef)
-    <7be>   DW_AT_name        : (strp) (offset: 0xa0a): ternaryfunc
-    <7c2>   DW_AT_decl_file   : (data1) 1
-    <7c3>   DW_AT_decl_line   : (data2) 306
-    <7c5>   DW_AT_decl_column : (data1) 22
-    <7c6>   DW_AT_type        : (ref4) <0x7ca>, PyObject, _object
- <1><7ca>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <7cb>   DW_AT_byte_size   : (data1) 8
-    <7cc>   DW_AT_type        : (ref4) <0x7d0>, PyObject, _object
- <1><7d0>: Abbrev Number: 16 (DW_TAG_subroutine_type)
-    <7d1>   DW_AT_prototyped  : (flag_present) 1
-    <7d1>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
-    <7d5>   DW_AT_sibling     : (ref4) <0x7e9>
- <2><7d9>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <7da>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <2><7de>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <7df>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <2><7e3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <7e4>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <2><7e8>: Abbrev Number: 0
- <1><7e9>: Abbrev Number: 23 (DW_TAG_typedef)
-    <7ea>   DW_AT_name        : (strp) (offset: 0xbbd): inquiry
-    <7ee>   DW_AT_decl_file   : (data1) 1
-    <7ef>   DW_AT_decl_line   : (data2) 307
-    <7f1>   DW_AT_decl_column : (data1) 15
-    <7f2>   DW_AT_type        : (ref4) <0x7f6>, int
- <1><7f6>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <7f7>   DW_AT_byte_size   : (data1) 8
-    <7f8>   DW_AT_type        : (ref4) <0x7fc>, int
- <1><7fc>: Abbrev Number: 16 (DW_TAG_subroutine_type)
-    <7fd>   DW_AT_prototyped  : (flag_present) 1
-    <7fd>   DW_AT_type        : (ref4) <0x40>, int
-    <801>   DW_AT_sibling     : (ref4) <0x80b>
- <2><805>: Abbrev Number: 17 (DW_TAG_formal_parameter)
-    <806>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
- <2><80a>: Abbrev Number: 0
